#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function Audio.Audio_C.SetToDefault
struct UAudio_C_SetToDefault_Params
{
};

// Function Audio.Audio_C.Save
struct UAudio_C_Save_Params
{
};

// Function Audio.Audio_C.Init
struct UAudio_C_Init_Params
{
};

// Function Audio.Audio_C.GetText_4
struct UAudio_C_GetText_4_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function Audio.Audio_C.GetText_3
struct UAudio_C_GetText_3_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function Audio.Audio_C.GetText_2
struct UAudio_C_GetText_2_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function Audio.Audio_C.GI
struct UAudio_C_GI_Params
{
	class UGI2_C*                                      AsGI2;                                                     // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Audio.Audio_C.GetText_1
struct UAudio_C_GetText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function Audio.Audio_C.Construct
struct UAudio_C_Construct_Params
{
};

// Function Audio.Audio_C.BndEvt__WB_Button03_Options_K2Node_ComponentBoundEvent_1_OnSliderChanged__DelegateSignature
struct UAudio_C_BndEvt__WB_Button03_Options_K2Node_ComponentBoundEvent_1_OnSliderChanged__DelegateSignature_Params
{
	float                                              ValueNormalized;                                           // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Audio.Audio_C.BndEvt__Music_K2Node_ComponentBoundEvent_3_OnSliderChanged__DelegateSignature
struct UAudio_C_BndEvt__Music_K2Node_ComponentBoundEvent_3_OnSliderChanged__DelegateSignature_Params
{
	float                                              ValueNormalized;                                           // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Audio.Audio_C.BndEvt__UiSFX_K2Node_ComponentBoundEvent_4_OnSliderChanged__DelegateSignature
struct UAudio_C_BndEvt__UiSFX_K2Node_ComponentBoundEvent_4_OnSliderChanged__DelegateSignature_Params
{
	float                                              ValueNormalized;                                           // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Audio.Audio_C.BndEvt__GameSFX_K2Node_ComponentBoundEvent_5_OnSliderChanged__DelegateSignature
struct UAudio_C_BndEvt__GameSFX_K2Node_ComponentBoundEvent_5_OnSliderChanged__DelegateSignature_Params
{
	float                                              ValueNormalized;                                           // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Audio.Audio_C.BndEvt__Ambience_K2Node_ComponentBoundEvent_15_OnSliderChanged__DelegateSignature
struct UAudio_C_BndEvt__Ambience_K2Node_ComponentBoundEvent_15_OnSliderChanged__DelegateSignature_Params
{
	float                                              ValueNormalized;                                           // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Audio.Audio_C.OnModifiedC
struct UAudio_C_OnModifiedC_Params
{
};

// Function Audio.Audio_C.BndEvt__Announcer_K2Node_ComponentBoundEvent_0_OnSliderChanged__DelegateSignature
struct UAudio_C_BndEvt__Announcer_K2Node_ComponentBoundEvent_0_OnSliderChanged__DelegateSignature_Params
{
	float                                              ValueNormalized;                                           // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Audio.Audio_C.ExecuteUbergraph_Audio
struct UAudio_C_ExecuteUbergraph_Audio_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Audio.Audio_C.OnModified__DelegateSignature
struct UAudio_C_OnModified__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
