#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function CognitoIdp.CognitoIdpClientObject.VerifyUserAttribute
struct UCognitoIdpClientObject_VerifyUserAttribute_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVerifyUserAttributeRequest                 VerifyUserAttributeRequest;                                // 0x0000(0x0030)  (Parm, NativeAccessSpecifierPublic)
	struct FVerifyUserAttributeResult                  VerifyUserAttributeResult;                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.VerifySoftwareToken
struct UCognitoIdpClientObject_VerifySoftwareToken_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVerifySoftwareTokenRequest                 VerifySoftwareTokenRequest;                                // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	struct FVerifySoftwareTokenResult                  VerifySoftwareTokenResult;                                 // 0x0000(0x0018)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.UpdateUserPoolDomain
struct UCognitoIdpClientObject_UpdateUserPoolDomain_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUpdateUserPoolDomainRequest                UpdateUserPoolDomainRequest;                               // 0x0000(0x0030)  (Parm, NativeAccessSpecifierPublic)
	struct FUpdateUserPoolDomainResult                 UpdateUserPoolDomainResult;                                // 0x0000(0x0010)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.UpdateUserPoolClient
struct UCognitoIdpClientObject_UpdateUserPoolClient_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUpdateUserPoolClientRequest                UpdateUserPoolClientRequest;                               // 0x0000(0x0108)  (Parm, NativeAccessSpecifierPublic)
	struct FUpdateUserPoolClientResult                 UpdateUserPoolClientResult;                                // 0x0000(0x0128)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.UpdateUserPool
struct UCognitoIdpClientObject_UpdateUserPool_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUpdateUserPoolRequest                      UpdateUserPoolRequest;                                     // 0x0000(0x0248)  (Parm, NativeAccessSpecifierPublic)
	struct FUpdateUserPoolResult                       UpdateUserPoolResult;                                      // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.UpdateUserAttributes
struct UCognitoIdpClientObject_UpdateUserAttributes_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUpdateUserAttributesRequest                UpdateUserAttributesRequest;                               // 0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
	struct FUpdateUserAttributesResult                 UpdateUserAttributesResult;                                // 0x0000(0x0010)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.UpdateResourceServer
struct UCognitoIdpClientObject_UpdateResourceServer_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUpdateResourceServerRequest                UpdateResourceServerRequest;                               // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	struct FUpdateResourceServerResult                 UpdateResourceServerResult;                                // 0x0000(0x0040)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.UpdateIdentityProvider
struct UCognitoIdpClientObject_UpdateIdentityProvider_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUpdateIdentityProviderRequest              UpdateIdentityProviderRequest;                             // 0x0000(0x00D0)  (Parm, NativeAccessSpecifierPublic)
	struct FUpdateIdentityProviderResult               UpdateIdentityProviderResult;                              // 0x0000(0x00E8)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.UpdateGroup
struct UCognitoIdpClientObject_UpdateGroup_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUpdateGroupRequest                         UpdateGroupRequest;                                        // 0x0000(0x0048)  (Parm, NativeAccessSpecifierPublic)
	struct FUpdateGroupResult                          UpdateGroupResult;                                         // 0x0000(0x0058)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.UpdateDeviceStatus
struct UCognitoIdpClientObject_UpdateDeviceStatus_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUpdateDeviceStatusRequest                  UpdateDeviceStatusRequest;                                 // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FUpdateDeviceStatusResult                   UpdateDeviceStatusResult;                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.UpdateAuthEventFeedback
struct UCognitoIdpClientObject_UpdateAuthEventFeedback_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUpdateAuthEventFeedbackRequest             UpdateAuthEventFeedbackRequest;                            // 0x0000(0x0048)  (Parm, NativeAccessSpecifierPublic)
	struct FUpdateAuthEventFeedbackResult              UpdateAuthEventFeedbackResult;                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.UntagResource
struct UCognitoIdpClientObject_UntagResource_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCognitoIdpUntagResourceRequest             untagResourceRequest;                                      // 0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
	struct FCognitoIdpUntagResourceResult              untagResourceResult;                                       // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.TagResource
struct UCognitoIdpClientObject_TagResource_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCognitoIdpTagResourceRequest               tagResourceRequest;                                        // 0x0000(0x0060)  (Parm, NativeAccessSpecifierPublic)
	struct FCognitoIdpTagResourceResult                tagResourceResult;                                         // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.StopUserImportJob
struct UCognitoIdpClientObject_StopUserImportJob_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStopUserImportJobRequest                   StopUserImportJobRequest;                                  // 0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
	struct FStopUserImportJobResult                    StopUserImportJobResult;                                   // 0x0000(0x0090)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.StartUserImportJob
struct UCognitoIdpClientObject_StartUserImportJob_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStartUserImportJobRequest                  StartUserImportJobRequest;                                 // 0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
	struct FStartUserImportJobResult                   StartUserImportJobResult;                                  // 0x0000(0x0090)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.SignUp
struct UCognitoIdpClientObject_SignUp_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSignUpRequest                              SignUpRequest;                                             // 0x0000(0x0080)  (Parm, NativeAccessSpecifierPublic)
	struct FSignUpResult                               SignUpResult;                                              // 0x0000(0x0040)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.SetUserSettings
struct UCognitoIdpClientObject_SetUserSettings_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSetUserSettingsRequest                     SetUserSettingsRequest;                                    // 0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
	struct FSetUserSettingsResult                      SetUserSettingsResult;                                     // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.SetUserPoolMfaConfig
struct UCognitoIdpClientObject_SetUserPoolMfaConfig_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSetUserPoolMfaConfigRequest                SetUserPoolMfaConfigRequest;                               // 0x0000(0x0048)  (Parm, NativeAccessSpecifierPublic)
	struct FSetUserPoolMfaConfigResult                 SetUserPoolMfaConfigResult;                                // 0x0000(0x0038)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.SetUserMFAPreference
struct UCognitoIdpClientObject_SetUserMFAPreference_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSetUserMFAPreferenceRequest                SetUserMFAPreferenceRequest;                               // 0x0000(0x0018)  (Parm, NativeAccessSpecifierPublic)
	struct FSetUserMFAPreferenceResult                 SetUserMFAPreferenceResult;                                // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.SetUICustomization
struct UCognitoIdpClientObject_SetUICustomization_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSetUICustomizationRequest                  SetUICustomizationRequest;                                 // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FSetUICustomizationResult                   SetUICustomizationResult;                                  // 0x0000(0x0060)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.SetRiskConfiguration
struct UCognitoIdpClientObject_SetRiskConfiguration_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSetRiskConfigurationRequest                SetRiskConfigurationRequest;                               // 0x0000(0x0120)  (Parm, NativeAccessSpecifierPublic)
	struct FSetRiskConfigurationResult                 SetRiskConfigurationResult;                                // 0x0000(0x0128)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.RespondToAuthChallenge
struct UCognitoIdpClientObject_RespondToAuthChallenge_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRespondToAuthChallengeRequest              RespondToAuthChallengeRequest;                             // 0x0000(0x0098)  (Parm, NativeAccessSpecifierPublic)
	struct FRespondToAuthChallengeResult               RespondToAuthChallengeResult;                              // 0x0000(0x00D0)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.ResendConfirmationCode
struct UCognitoIdpClientObject_ResendConfirmationCode_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResendConfirmationCodeRequest              ResendConfirmationCodeRequest;                             // 0x0000(0x0050)  (Parm, NativeAccessSpecifierPublic)
	struct FResendConfirmationCodeResult               ResendConfirmationCodeResult;                              // 0x0000(0x0028)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.ListUsersInGroup
struct UCognitoIdpClientObject_ListUsersInGroup_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FListUsersInGroupRequest                    ListUsersInGroupRequest;                                   // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FListUsersInGroupResult                     ListUsersInGroupResult;                                    // 0x0000(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.ListUsers
struct UCognitoIdpClientObject_ListUsers_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FListUsersRequest                           ListUsersRequest;                                          // 0x0000(0x0048)  (Parm, NativeAccessSpecifierPublic)
	struct FListUsersResult                            ListUsersResult;                                           // 0x0000(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.ListUserPools
struct UCognitoIdpClientObject_ListUserPools_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FListUserPoolsRequest                       ListUserPoolsRequest;                                      // 0x0000(0x0018)  (Parm, NativeAccessSpecifierPublic)
	struct FListUserPoolsResult                        ListUserPoolsResult;                                       // 0x0000(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.ListUserPoolClients
struct UCognitoIdpClientObject_ListUserPoolClients_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FListUserPoolClientsRequest                 ListUserPoolClientsRequest;                                // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FListUserPoolClientsResult                  ListUserPoolClientsResult;                                 // 0x0000(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.ListUserImportJobs
struct UCognitoIdpClientObject_ListUserImportJobs_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FListUserImportJobsRequest                  ListUserImportJobsRequest;                                 // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FListUserImportJobsResult                   ListUserImportJobsResult;                                  // 0x0000(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.ListTagsForResource
struct UCognitoIdpClientObject_ListTagsForResource_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCognitoIdpListTagsForResourceRequest       listTagsForResourceRequest;                                // 0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
	struct FCognitoIdpListTagsForResourceResult        listTagsForResourceResult;                                 // 0x0000(0x0050)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.ListResourceServers
struct UCognitoIdpClientObject_ListResourceServers_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FListResourceServersRequest                 ListResourceServersRequest;                                // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FListResourceServersResult                  ListResourceServersResult;                                 // 0x0000(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.ListIdentityProviders
struct UCognitoIdpClientObject_ListIdentityProviders_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FListIdentityProvidersRequest               ListIdentityProvidersRequest;                              // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FListIdentityProvidersResult                ListIdentityProvidersResult;                               // 0x0000(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.ListGroups
struct UCognitoIdpClientObject_ListGroups_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FListGroupsRequest                          ListGroupsRequest;                                         // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FListGroupsResult                           ListGroupsResult;                                          // 0x0000(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.ListDevices
struct UCognitoIdpClientObject_ListDevices_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FListDevicesRequest                         ListDevicesRequest;                                        // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FListDevicesResult                          ListDevicesResult;                                         // 0x0000(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.InitiateAuth
struct UCognitoIdpClientObject_InitiateAuth_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInitiateAuthRequest                        InitiateAuthRequest;                                       // 0x0000(0x00D8)  (Parm, NativeAccessSpecifierPublic)
	struct FInitiateAuthResult                         InitiateAuthResult;                                        // 0x0000(0x00D0)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.GlobalSignOut
struct UCognitoIdpClientObject_GlobalSignOut_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGlobalSignOutRequest                       GlobalSignOutRequest;                                      // 0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
	struct FGlobalSignOutResult                        GlobalSignOutResult;                                       // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.GetUserPoolMfaConfig
struct UCognitoIdpClientObject_GetUserPoolMfaConfig_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGetUserPoolMfaConfigRequest                GetUserPoolMfaConfigRequest;                               // 0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
	struct FGetUserPoolMfaConfigResult                 GetUserPoolMfaConfigResult;                                // 0x0000(0x0038)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.GetUserAttributeVerificationCode
struct UCognitoIdpClientObject_GetUserAttributeVerificationCode_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGetUserAttributeVerificationCodeRequest    GetUserAttributeVerificationCodeRequest;                   // 0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
	struct FGetUserAttributeVerificationCodeResult     GetUserAttributeVerificationCodeResult;                    // 0x0000(0x0028)  (Parm, OutParm, NativeAccessSpecifierPublic)
	CognitoIdp_ECognitoIdpError                        errorType;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     errorMessage;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CognitoIdp.CognitoIdpClientObject.GetUser
struct UCognitoIdpClientObject_GetUser_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Success;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGetUserRequest                             GetUserRequest;                                            // 0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
