#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum CognitoIdp.EAccountTakeoverEventActionType
enum class CognitoIdp_EAccountTakeoverEventActionType : uint8_t
{
	EAccountTakeoverEventActionType__NOT_SET = 0,
	EAccountTakeoverEventActionType__BLOCK = 1,
	EAccountTakeoverEventActionType__MFA_IF_CONFIGURED = 2,
	EAccountTakeoverEventActionType__MFA_REQUIRED = 3,
	EAccountTakeoverEventActionType__NO_ACTION = 4,
	EAccountTakeoverEventActionType__EAccountTakeoverEventActionType_MAX = 5,

};

// Enum CognitoIdp.EAdvancedSecurityModeType
enum class CognitoIdp_EAdvancedSecurityModeType : uint8_t
{
	EAdvancedSecurityModeType__NOT_SET = 0,
	EAdvancedSecurityModeType__OFF = 1,
	EAdvancedSecurityModeType__AUDIT = 2,
	EAdvancedSecurityModeType__ENFORCED = 3,
	EAdvancedSecurityModeType__EAdvancedSecurityModeType_MAX = 4,

};

// Enum CognitoIdp.EAliasAttributeType
enum class CognitoIdp_EAliasAttributeType : uint8_t
{
	EAliasAttributeType__NOT_SET   = 0,
	EAliasAttributeType__phone_number = 1,
	EAliasAttributeType__email     = 2,
	EAliasAttributeType__preferred_username = 3,
	EAliasAttributeType__EAliasAttributeType_MAX = 4,

};

// Enum CognitoIdp.EAttributeDataType
enum class CognitoIdp_EAttributeDataType : uint8_t
{
	EAttributeDataType__NOT_SET    = 0,
	EAttributeDataType__String     = 1,
	EAttributeDataType__Number     = 2,
	EAttributeDataType__DateTime   = 3,
	EAttributeDataType__Boolean    = 4,
	EAttributeDataType__EAttributeDataType_MAX = 5,

};

// Enum CognitoIdp.EAuthFlowType
enum class CognitoIdp_EAuthFlowType : uint8_t
{
	EAuthFlowType__NOT_SET         = 0,
	EAuthFlowType__USER_SRP_AUTH   = 1,
	EAuthFlowType__REFRESH_TOKEN_AUTH = 2,
	EAuthFlowType__REFRESH_TOKEN   = 3,
	EAuthFlowType__CUSTOM_AUTH     = 4,
	EAuthFlowType__ADMIN_NO_SRP_AUTH = 5,
	EAuthFlowType__USER_PASSWORD_AUTH = 6,
	EAuthFlowType__EAuthFlowType_MAX = 7,

};

// Enum CognitoIdp.EChallengeName
enum class CognitoIdp_EChallengeName : uint8_t
{
	EChallengeName__NOT_SET        = 0,
	EChallengeName__Password       = 1,
	EChallengeName__Mfa            = 2,
	EChallengeName__EChallengeName_MAX = 3,

};

// Enum CognitoIdp.EChallengeNameType
enum class CognitoIdp_EChallengeNameType : uint8_t
{
	EChallengeNameType__NOT_SET    = 0,
	EChallengeNameType__SMS_MFA    = 1,
	EChallengeNameType__SOFTWARE_TOKEN_MFA = 2,
	EChallengeNameType__SELECT_MFA_TYPE = 3,
	EChallengeNameType__MFA_SETUP  = 4,
	EChallengeNameType__PASSWORD_VERIFIER = 5,
	EChallengeNameType__CUSTOM_CHALLENGE = 6,
	EChallengeNameType__DEVICE_SRP_AUTH = 7,
	EChallengeNameType__DEVICE_PASSWORD_VERIFIER = 8,
	EChallengeNameType__ADMIN_NO_SRP_AUTH = 9,
	EChallengeNameType__NEW_PASSWORD_REQUIRED = 10,
	EChallengeNameType__EChallengeNameType_MAX = 11,

};

// Enum CognitoIdp.EChallengeResponse
enum class CognitoIdp_EChallengeResponse : uint8_t
{
	EChallengeResponse__NOT_SET    = 0,
	EChallengeResponse__Success    = 1,
	EChallengeResponse__Failure    = 2,
	EChallengeResponse__EChallengeResponse_MAX = 3,

};

// Enum CognitoIdp.ECognitoIdpError
enum class CognitoIdp_ECognitoIdpError : uint8_t
{
	ECognitoIdpError__INCOMPLETE_SIGNATURE = 0,
	ECognitoIdpError__INTERNAL_FAILURE = 1,
	ECognitoIdpError__INVALID_ACTION = 2,
	ECognitoIdpError__INVALID_CLIENT_TOKEN_ID = 3,
	ECognitoIdpError__INVALID_PARAMETER_COMBINATION = 4,
	ECognitoIdpError__INVALID_QUERY_PARAMETER = 5,
	ECognitoIdpError__INVALID_PARAMETER_VALUE = 6,
	ECognitoIdpError__MISSING_ACTION = 7,
	ECognitoIdpError__MISSING_AUTHENTICATION_TOKEN = 8,
	ECognitoIdpError__MISSING_PARAMETER = 9,
	ECognitoIdpError__OPT_IN_REQUIRED = 10,
	ECognitoIdpError__REQUEST_EXPIRED = 11,
	ECognitoIdpError__SERVICE_UNAVAILABLE = 12,
	ECognitoIdpError__THROTTLING   = 13,
	ECognitoIdpError__VALIDATION   = 14,
	ECognitoIdpError__ACCESS_DENIED = 15,
	ECognitoIdpError__RESOURCE_NOT_FOUND = 16,
	ECognitoIdpError__UNRECOGNIZED_CLIENT = 17,
	ECognitoIdpError__MALFORMED_QUERY_STRING = 18,
	ECognitoIdpError__SLOW_DOWN    = 19,
	ECognitoIdpError__REQUEST_TIME_TOO_SKEWED = 20,
	ECognitoIdpError__INVALID_SIGNATURE = 21,
	ECognitoIdpError__SIGNATURE_DOES_NOT_MATCH = 22,
	ECognitoIdpError__INVALID_ACCESS_KEY_ID = 23,
	ECognitoIdpError__REQUEST_TIMEOUT = 24,
	ECognitoIdpError__NETWORK_CONNECTION = 25,
	ECognitoIdpError__UNKNOWN      = 26,
	ECognitoIdpError__ALIAS_EXISTS = 27,
	ECognitoIdpError__CODE_DELIVERY_FAILURE = 28,
	ECognitoIdpError__CODE_MISMATCH = 29,
	ECognitoIdpError__CONCURRENT_MODIFICATION = 30,
	ECognitoIdpError__DUPLICATE_PROVIDER = 31,
	ECognitoIdpError__ENABLE_SOFTWARE_TOKEN_MFA = 32,
	ECognitoIdpError__EXPIRED_CODE = 33,
	ECognitoIdpError__GROUP_EXISTS = 34,
	ECognitoIdpError__INTERNAL_ERROR = 35,
	ECognitoIdpError__INVALID_EMAIL_ROLE_ACCESS_POLICY = 36,
	ECognitoIdpError__INVALID_LAMBDA_RESPONSE = 37,
	ECognitoIdpError__INVALID_OAUTH_FLOW = 38,
	ECognitoIdpError__INVALID_PARAMETER = 39,
	ECognitoIdpError__INVALID_PASSWORD = 40,
	ECognitoIdpError__INVALID_SMS_ROLE_ACCESS_POLICY = 41,
	ECognitoIdpError__INVALID_SMS_ROLE_TRUST_RELATIONSHIP = 42,
	ECognitoIdpError__INVALID_USER_POOL_CONFIGURATION = 43,
	ECognitoIdpError__LIMIT_EXCEEDED = 44,
	ECognitoIdpError__MFA_METHOD_NOT_FOUND = 45,
	ECognitoIdpError__NOT_AUTHORIZED = 46,
	ECognitoIdpError__PASSWORD_RESET_REQUIRED = 47,
	ECognitoIdpError__PRECONDITION_NOT_MET = 48,
	ECognitoIdpError__SCOPE_DOES_NOT_EXIST = 49,
	ECognitoIdpError__SOFTWARE_TOKEN_MFA_NOT_FOUND = 50,
	ECognitoIdpError__TOO_MANY_FAILED_ATTEMPTS = 51,
	ECognitoIdpError__TOO_MANY_REQUESTS = 52,
	ECognitoIdpError__UNEXPECTED_LAMBDA = 53,
	ECognitoIdpError__UNSUPPORTED_IDENTITY_PROVIDER = 54,
	ECognitoIdpError__UNSUPPORTED_USER_STATE = 55,
	ECognitoIdpError__USERNAME_EXISTS = 56,
	ECognitoIdpError__USER_IMPORT_IN_PROGRESS = 57,
	ECognitoIdpError__USER_LAMBDA_VALIDATION = 58,
	ECognitoIdpError__USER_NOT_CONFIRMED = 59,
	ECognitoIdpError__USER_NOT_FOUND = 60,
	ECognitoIdpError__USER_POOL_ADDON_NOT_ENABLED = 61,
	ECognitoIdpError__USER_POOL_TAGGING = 62,
	ECognitoIdpError__ECognitoIdpError_MAX = 63,

};

// Enum CognitoIdp.ECompromisedCredentialsEventActionType
enum class CognitoIdp_ECompromisedCredentialsEventActionType : uint8_t
{
	ECompromisedCredentialsEventActionType__NOT_SET = 0,
	ECompromisedCredentialsEventActionType__BLOCK = 1,
	ECompromisedCredentialsEventActionType__NO_ACTION = 2,
	ECompromisedCredentialsEventActionType__ECompromisedCredentialsEventActionType_MAX = 3,

};

// Enum CognitoIdp.EDefaultEmailOptionType
enum class CognitoIdp_EDefaultEmailOptionType : uint8_t
{
	EDefaultEmailOptionType__NOT_SET = 0,
	EDefaultEmailOptionType__CONFIRM_WITH_LINK = 1,
	EDefaultEmailOptionType__CONFIRM_WITH_CODE = 2,
	EDefaultEmailOptionType__EDefaultEmailOptionType_MAX = 3,

};

// Enum CognitoIdp.EDeliveryMediumType
enum class CognitoIdp_EDeliveryMediumType : uint8_t
{
	EDeliveryMediumType__NOT_SET   = 0,
	EDeliveryMediumType__SMS       = 1,
	EDeliveryMediumType__EMAIL     = 2,
	EDeliveryMediumType__EDeliveryMediumType_MAX = 3,

};

// Enum CognitoIdp.EDeviceRememberedStatusType
enum class CognitoIdp_EDeviceRememberedStatusType : uint8_t
{
	EDeviceRememberedStatusType__NOT_SET = 0,
	EDeviceRememberedStatusType__remembered = 1,
	EDeviceRememberedStatusType__not_remembered = 2,
	EDeviceRememberedStatusType__EDeviceRememberedStatusType_MAX = 3,

};

// Enum CognitoIdp.EDomainStatusType
enum class CognitoIdp_EDomainStatusType : uint8_t
{
	EDomainStatusType__NOT_SET     = 0,
	EDomainStatusType__CREATING    = 1,
	EDomainStatusType__DELETING    = 2,
	EDomainStatusType__UPDATING    = 3,
	EDomainStatusType__ACTIVE      = 4,
	EDomainStatusType__FAILED      = 5,
	EDomainStatusType__EDomainStatusType_MAX = 6,

};

// Enum CognitoIdp.EEmailSendingAccountType
enum class CognitoIdp_EEmailSendingAccountType : uint8_t
{
	EEmailSendingAccountType__NOT_SET = 0,
	EEmailSendingAccountType__COGNITO_DEFAULT = 1,
	EEmailSendingAccountType__DEVELOPER = 2,
	EEmailSendingAccountType__EEmailSendingAccountType_MAX = 3,

};

// Enum CognitoIdp.EEventFilterType
enum class CognitoIdp_EEventFilterType : uint8_t
{
	EEventFilterType__NOT_SET      = 0,
	EEventFilterType__SIGN_IN      = 1,
	EEventFilterType__PASSWORD_CHANGE = 2,
	EEventFilterType__SIGN_UP      = 3,
	EEventFilterType__EEventFilterType_MAX = 4,

};

// Enum CognitoIdp.EEventResponseType
enum class CognitoIdp_EEventResponseType : uint8_t
{
	EEventResponseType__NOT_SET    = 0,
	EEventResponseType__Success    = 1,
	EEventResponseType__Failure    = 2,
	EEventResponseType__EEventResponseType_MAX = 3,

};

// Enum CognitoIdp.EEventType
enum class CognitoIdp_EEventType : uint8_t
{
	EEventType__NOT_SET            = 0,
	EEventType__SignIn             = 1,
	EEventType__SignUp             = 2,
	EEventType__ForgotPassword     = 3,
	EEventType__EEventType_MAX     = 4,

};

// Enum CognitoIdp.EExplicitAuthFlowsType
enum class CognitoIdp_EExplicitAuthFlowsType : uint8_t
{
	EExplicitAuthFlowsType__NOT_SET = 0,
	EExplicitAuthFlowsType__ADMIN_NO_SRP_AUTH = 1,
	EExplicitAuthFlowsType__CUSTOM_AUTH_FLOW_ONLY = 2,
	EExplicitAuthFlowsType__USER_PASSWORD_AUTH = 3,
	EExplicitAuthFlowsType__EExplicitAuthFlowsType_MAX = 4,

};

// Enum CognitoIdp.EFeedbackValueType
enum class CognitoIdp_EFeedbackValueType : uint8_t
{
	EFeedbackValueType__NOT_SET    = 0,
	EFeedbackValueType__Valid      = 1,
	EFeedbackValueType__Invalid    = 2,
	EFeedbackValueType__EFeedbackValueType_MAX = 3,

};

// Enum CognitoIdp.EIdentityProviderTypeType
enum class CognitoIdp_EIdentityProviderTypeType : uint8_t
{
	EIdentityProviderTypeType__NOT_SET = 0,
	EIdentityProviderTypeType__SAML = 1,
	EIdentityProviderTypeType__Facebook = 2,
	EIdentityProviderTypeType__Google = 3,
	EIdentityProviderTypeType__LoginWithAmazon = 4,
	EIdentityProviderTypeType__OIDC = 5,
	EIdentityProviderTypeType__EIdentityProviderTypeType_MAX = 6,

};

// Enum CognitoIdp.EMessageActionType
enum class CognitoIdp_EMessageActionType : uint8_t
{
	EMessageActionType__NOT_SET    = 0,
	EMessageActionType__RESEND     = 1,
	EMessageActionType__SUPPRESS   = 2,
	EMessageActionType__EMessageActionType_MAX = 3,

};

// Enum CognitoIdp.EOAuthFlowType
enum class CognitoIdp_EOAuthFlowType : uint8_t
{
	EOAuthFlowType__NOT_SET        = 0,
	EOAuthFlowType__code           = 1,
	EOAuthFlowType__implicit       = 2,
	EOAuthFlowType__client_credentials = 3,
	EOAuthFlowType__EOAuthFlowType_MAX = 4,

};

// Enum CognitoIdp.ERiskDecisionType
enum class CognitoIdp_ERiskDecisionType : uint8_t
{
	ERiskDecisionType__NOT_SET     = 0,
	ERiskDecisionType__NoRisk      = 1,
	ERiskDecisionType__AccountTakeover = 2,
	ERiskDecisionType__Block       = 3,
	ERiskDecisionType__ERiskDecisionType_MAX = 4,

};

// Enum CognitoIdp.ERiskLevelType
enum class CognitoIdp_ERiskLevelType : uint8_t
{
	ERiskLevelType__NOT_SET        = 0,
	ERiskLevelType__Low            = 1,
	ERiskLevelType__Medium         = 2,
	ERiskLevelType__High           = 3,
	ERiskLevelType__ERiskLevelType_MAX = 4,

};

// Enum CognitoIdp.EStatusType
enum class CognitoIdp_EStatusType : uint8_t
{
	EStatusType__NOT_SET           = 0,
	EStatusType__Enabled           = 1,
	EStatusType__Disabled          = 2,
	EStatusType__EStatusType_MAX   = 3,

};

// Enum CognitoIdp.EUserImportJobStatusType
enum class CognitoIdp_EUserImportJobStatusType : uint8_t
{
	EUserImportJobStatusType__NOT_SET = 0,
	EUserImportJobStatusType__Created = 1,
	EUserImportJobStatusType__Pending = 2,
	EUserImportJobStatusType__InProgress = 3,
	EUserImportJobStatusType__Stopping = 4,
	EUserImportJobStatusType__Expired = 5,
	EUserImportJobStatusType__Stopped = 6,
	EUserImportJobStatusType__Failed = 7,
	EUserImportJobStatusType__Succeeded = 8,
	EUserImportJobStatusType__EUserImportJobStatusType_MAX = 9,

};

// Enum CognitoIdp.EUsernameAttributeType
enum class CognitoIdp_EUsernameAttributeType : uint8_t
{
	EUsernameAttributeType__NOT_SET = 0,
	EUsernameAttributeType__phone_number = 1,
	EUsernameAttributeType__email  = 2,
	EUsernameAttributeType__EUsernameAttributeType_MAX = 3,

};

// Enum CognitoIdp.EUserPoolMfaType
enum class CognitoIdp_EUserPoolMfaType : uint8_t
{
	EUserPoolMfaType__NOT_SET      = 0,
	EUserPoolMfaType__OFF          = 1,
	EUserPoolMfaType__ON           = 2,
	EUserPoolMfaType__OPTIONAL     = 3,
	EUserPoolMfaType__EUserPoolMfaType_MAX = 4,

};

// Enum CognitoIdp.EUserStatusType
enum class CognitoIdp_EUserStatusType : uint8_t
{
	EUserStatusType__NOT_SET       = 0,
	EUserStatusType__UNCONFIRMED   = 1,
	EUserStatusType__CONFIRMED     = 2,
	EUserStatusType__ARCHIVED      = 3,
	EUserStatusType__COMPROMISED   = 4,
	EUserStatusType__UNKNOWN       = 5,
	EUserStatusType__RESET_REQUIRED = 6,
	EUserStatusType__FORCE_CHANGE_PASSWORD = 7,
	EUserStatusType__EUserStatusType_MAX = 8,

};

// Enum CognitoIdp.EVerifiedAttributeType
enum class CognitoIdp_EVerifiedAttributeType : uint8_t
{
	EVerifiedAttributeType__NOT_SET = 0,
	EVerifiedAttributeType__phone_number = 1,
	EVerifiedAttributeType__email  = 2,
	EVerifiedAttributeType__EVerifiedAttributeType_MAX = 3,

};

// Enum CognitoIdp.EVerifySoftwareTokenResponseType
enum class CognitoIdp_EVerifySoftwareTokenResponseType : uint8_t
{
	EVerifySoftwareTokenResponseType__NOT_SET = 0,
	EVerifySoftwareTokenResponseType__SUCCESS = 1,
	EVerifySoftwareTokenResponseType__ERROR_ = 2,
	EVerifySoftwareTokenResponseType__EVerifySoftwareTokenResponseType_MAX = 3,

};

//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct CognitoIdp.VerifyUserAttributeRequest
// 0x0030
struct FVerifyUserAttributeRequest
{
	struct FString                                     accessToken;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     attributeName;                                             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     code;                                                      // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.VerifyUserAttributeResult
// 0x0001
struct FVerifyUserAttributeResult
{
	unsigned char                                      UnknownData_YGQG[0x1];                                     // 0x0000(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.VerifySoftwareTokenRequest
// 0x0040
struct FVerifySoftwareTokenRequest
{
	struct FString                                     accessToken;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     session;                                                   // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     userCode;                                                  // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     friendlyDeviceName;                                        // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.VerifySoftwareTokenResult
// 0x0018
struct FVerifySoftwareTokenResult
{
	CognitoIdp_EVerifySoftwareTokenResponseType        status;                                                    // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9XXS[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     session;                                                   // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.CustomDomainConfigType
// 0x0010
struct FCustomDomainConfigType
{
	struct FString                                     certificateArn;                                            // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.UpdateUserPoolDomainResult
// 0x0010
struct FUpdateUserPoolDomainResult
{
	struct FString                                     cloudFrontDomain;                                          // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.AnalyticsConfigurationType
// 0x0038
struct FAnalyticsConfigurationType
{
	struct FString                                     applicationId;                                             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     roleArn;                                                   // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     externalId;                                                // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               userDataShared;                                            // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_AF5U[0x7];                                     // 0x0031(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.PasswordPolicyType
// 0x000C
struct FPasswordPolicyType
{
	int                                                minimumLength;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               requireUppercase;                                          // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               requireLowercase;                                          // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               requireNumbers;                                            // 0x0006(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               requireSymbols;                                            // 0x0007(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                temporaryPasswordValidityDays;                             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.LambdaConfigType
// 0x00A0
struct FLambdaConfigType
{
	struct FString                                     preSignUp;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     customMessage;                                             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     postConfirmation;                                          // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     preAuthentication;                                         // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     postAuthentication;                                        // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     defineAuthChallenge;                                       // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     createAuthChallenge;                                       // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     verifyAuthChallengeResponse;                               // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     preTokenGeneration;                                        // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     userMigration;                                             // 0x0090(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.VerificationMessageTemplateType
// 0x0058
struct FVerificationMessageTemplateType
{
	struct FString                                     SMSMessage;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     emailMessage;                                              // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     emailSubject;                                              // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     emailMessageByLink;                                        // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     emailSubjectByLink;                                        // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	CognitoIdp_EDefaultEmailOptionType                 defaultEmailOption;                                        // 0x0050(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_Z0Q2[0x7];                                     // 0x0051(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.DeviceConfigurationType
// 0x0002
struct FDeviceConfigurationType
{
	bool                                               challengeRequiredOnNewDevice;                              // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               deviceOnlyRememberedOnUserPrompt;                          // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.EmailConfigurationType
// 0x0028
struct FEmailConfigurationType
{
	struct FString                                     sourceArn;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     replyToEmailAddress;                                       // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	CognitoIdp_EEmailSendingAccountType                emailSendingAccount;                                       // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KBAM[0x7];                                     // 0x0021(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.SmsConfigurationType
// 0x0020
struct FSmsConfigurationType
{
	struct FString                                     snsCallerArn;                                              // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     externalId;                                                // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.MessageTemplateType
// 0x0030
struct FMessageTemplateType
{
	struct FString                                     SMSMessage;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     emailMessage;                                              // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     emailSubject;                                              // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.UserPoolAddOnsType
// 0x0001
struct FUserPoolAddOnsType
{
	CognitoIdp_EAdvancedSecurityModeType               advancedSecurityMode;                                      // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.UpdateUserPoolResult
// 0x0001
struct FUpdateUserPoolResult
{
	unsigned char                                      UnknownData_FWFX[0x1];                                     // 0x0000(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.AttributeType
// 0x0020
struct FAttributeType
{
	struct FString                                     Name;                                                      // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Value;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.CodeDeliveryDetailsType
// 0x0028
struct FCodeDeliveryDetailsType
{
	struct FString                                     destination;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	CognitoIdp_EDeliveryMediumType                     deliveryMedium;                                            // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_N5KR[0x7];                                     // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     attributeName;                                             // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.ResourceServerScopeType
// 0x0020
struct FResourceServerScopeType
{
	struct FString                                     scopeName;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     scopeDescription;                                          // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.UpdateIdentityProviderRequest
// 0x00D0
struct FUpdateIdentityProviderRequest
{
	struct FString                                     userPoolId;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     providerName;                                              // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FString, struct FString>               providerDetails;                                           // 0x0020(0x0050) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FString, struct FString>               attributeMapping;                                          // 0x0070(0x0050) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FString>                             idpIdentifiers;                                            // 0x00C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.UpdateGroupRequest
// 0x0048
struct FUpdateGroupRequest
{
	struct FString                                     groupName;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     userPoolId;                                                // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Description;                                               // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     roleArn;                                                   // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                precedence;                                                // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8T6C[0x4];                                     // 0x0044(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.UpdateDeviceStatusRequest
// 0x0028
struct FUpdateDeviceStatusRequest
{
	struct FString                                     accessToken;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     deviceKey;                                                 // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	CognitoIdp_EDeviceRememberedStatusType             deviceRememberedStatus;                                    // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2IA2[0x7];                                     // 0x0021(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.UpdateDeviceStatusResult
// 0x0001
struct FUpdateDeviceStatusResult
{
	unsigned char                                      UnknownData_KIHY[0x1];                                     // 0x0000(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.UpdateAuthEventFeedbackRequest
// 0x0048
struct FUpdateAuthEventFeedbackRequest
{
	struct FString                                     userPoolId;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     userName;                                                  // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     eventId;                                                   // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     feedbackToken;                                             // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	CognitoIdp_EFeedbackValueType                      feedbackValue;                                             // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UICJ[0x7];                                     // 0x0041(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.UpdateAuthEventFeedbackResult
// 0x0001
struct FUpdateAuthEventFeedbackResult
{
	unsigned char                                      UnknownData_W691[0x1];                                     // 0x0000(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.CognitoIdpUntagResourceRequest
// 0x0020
struct FCognitoIdpUntagResourceRequest
{
	struct FString                                     resourceArn;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             tagKeys;                                                   // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.CognitoIdpUntagResourceResult
// 0x0001
struct FCognitoIdpUntagResourceResult
{
	unsigned char                                      UnknownData_GDE1[0x1];                                     // 0x0000(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.CognitoIdpTagResourceRequest
// 0x0060
struct FCognitoIdpTagResourceRequest
{
	struct FString                                     resourceArn;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FString, struct FString>               Tags;                                                      // 0x0010(0x0050) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.CognitoIdpTagResourceResult
// 0x0001
struct FCognitoIdpTagResourceResult
{
	unsigned char                                      UnknownData_DJG7[0x1];                                     // 0x0000(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.StopUserImportJobRequest
// 0x0020
struct FStopUserImportJobRequest
{
	struct FString                                     userPoolId;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     jobId;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.UserImportJobType
// 0x0090
struct FUserImportJobType
{
	struct FString                                     jobName;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     jobId;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     userPoolId;                                                // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     preSignedUrl;                                              // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   creationDate;                                              // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   startDate;                                                 // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   completionDate;                                            // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	CognitoIdp_EUserImportJobStatusType                status;                                                    // 0x0058(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DYKW[0x7];                                     // 0x0059(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     cloudWatchLogsRoleArn;                                     // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                importedUsers;                                             // 0x0070(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                skippedUsers;                                              // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                failedUsers;                                               // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_M40C[0x4];                                     // 0x007C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     completionMessage;                                         // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.StartUserImportJobRequest
// 0x0020
struct FStartUserImportJobRequest
{
	struct FString                                     userPoolId;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     jobId;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.AnalyticsMetadataType
// 0x0010
struct FAnalyticsMetadataType
{
	struct FString                                     analyticsEndpointId;                                       // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.UserContextDataType
// 0x0010
struct FUserContextDataType
{
	struct FString                                     encodedData;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.SignUpRequest
// 0x0080
struct FSignUpRequest
{
	struct FString                                     ClientId;                                                  // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     secretHash;                                                // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     userName;                                                  // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Password;                                                  // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAttributeType>                      userAttributes;                                            // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAttributeType>                      validationData;                                            // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FAnalyticsMetadataType                      analyticsMetadata;                                         // 0x0060(0x0010) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FUserContextDataType                        userContextData;                                           // 0x0070(0x0010) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.MFAOptionType
// 0x0018
struct FMFAOptionType
{
	CognitoIdp_EDeliveryMediumType                     deliveryMedium;                                            // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_MSS4[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     attributeName;                                             // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.SetUserSettingsResult
// 0x0001
struct FSetUserSettingsResult
{
	unsigned char                                      UnknownData_BGS6[0x1];                                     // 0x0000(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.SoftwareTokenMfaConfigType
// 0x0001
struct FSoftwareTokenMfaConfigType
{
	bool                                               Enabled;                                                   // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.SMSMfaSettingsType
// 0x0002
struct FSMSMfaSettingsType
{
	bool                                               Enabled;                                                   // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               preferredMfa;                                              // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.SoftwareTokenMfaSettingsType
// 0x0002
struct FSoftwareTokenMfaSettingsType
{
	bool                                               Enabled;                                                   // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               preferredMfa;                                              // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.SetUserMFAPreferenceResult
// 0x0001
struct FSetUserMFAPreferenceResult
{
	unsigned char                                      UnknownData_3QV4[0x1];                                     // 0x0000(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.SetUICustomizationRequest
// 0x0038
struct FSetUICustomizationRequest
{
	struct FString                                     userPoolId;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ClientId;                                                  // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     CSS;                                                       // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                                  imageFile;                                                 // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.CompromisedCredentialsActionsType
// 0x0001
struct FCompromisedCredentialsActionsType
{
	CognitoIdp_ECompromisedCredentialsEventActionType  eventAction;                                               // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.NotifyEmailType
// 0x0030
struct FNotifyEmailType
{
	struct FString                                     subject;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     htmlBody;                                                  // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     textBody;                                                  // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.AccountTakeoverActionType
// 0x0002
struct FAccountTakeoverActionType
{
	bool                                               notify;                                                    // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	CognitoIdp_EAccountTakeoverEventActionType         eventAction;                                               // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.AccountTakeoverActionsType
// 0x0006
struct FAccountTakeoverActionsType
{
	struct FAccountTakeoverActionType                  lowAction;                                                 // 0x0000(0x0002) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FAccountTakeoverActionType                  mediumAction;                                              // 0x0002(0x0002) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FAccountTakeoverActionType                  highAction;                                                // 0x0004(0x0002) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.RiskExceptionConfigurationType
// 0x0020
struct FRiskExceptionConfigurationType
{
	TArray<struct FString>                             blockedIPRangeList;                                        // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FString>                             skippedIPRangeList;                                        // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.NewDeviceMetadataType
// 0x0020
struct FNewDeviceMetadataType
{
	struct FString                                     deviceKey;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     deviceGroupKey;                                            // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.ListUsersInGroupRequest
// 0x0038
struct FListUsersInGroupRequest
{
	struct FString                                     userPoolId;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     groupName;                                                 // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                limit;                                                     // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QQM5[0x4];                                     // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     nextToken;                                                 // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.ListUsersRequest
// 0x0048
struct FListUsersRequest
{
	struct FString                                     userPoolId;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             attributesToGet;                                           // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                limit;                                                     // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_R91M[0x4];                                     // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     paginationToken;                                           // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Filter;                                                    // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.ListUserPoolsRequest
// 0x0018
struct FListUserPoolsRequest
{
	struct FString                                     nextToken;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                maxResults;                                                // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FGPU[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct CognitoIdp.ListUserPoolClientsRequest
// 0x0028
struct FListUserPoolClientsRequest
{
	struct FString                                     userPoolId;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                maxResults;                                                // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1JUR[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     nextToken;                                                 // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.UserPoolClientDescription
// 0x0030
struct FUserPoolClientDescription
{
	struct FString                                     ClientId;                                                  // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     userPoolId;                                                // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     clientName;                                                // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.ListUserImportJobsRequest
// 0x0028
struct FListUserImportJobsRequest
{
	struct FString                                     userPoolId;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                maxResults;                                                // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_AMW4[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     paginationToken;                                           // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.CognitoIdpListTagsForResourceRequest
// 0x0010
struct FCognitoIdpListTagsForResourceRequest
{
	struct FString                                     resourceArn;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.CognitoIdpListTagsForResourceResult
// 0x0050
struct FCognitoIdpListTagsForResourceResult
{
	TMap<struct FString, struct FString>               Tags;                                                      // 0x0000(0x0050) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.ListResourceServersRequest
// 0x0028
struct FListResourceServersRequest
{
	struct FString                                     userPoolId;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                maxResults;                                                // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1SG0[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     nextToken;                                                 // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.ResourceServerType
// 0x0040
struct FResourceServerType
{
	struct FString                                     userPoolId;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Identifier;                                                // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Name;                                                      // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FResourceServerScopeType>            scopes;                                                    // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.ListResourceServersResult
// 0x0020
struct FListResourceServersResult
{
	TArray<struct FResourceServerType>                 resourceServers;                                           // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FString                                     nextToken;                                                 // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct CognitoIdp.ListIdentityProvidersRequest
// 0x0028
struct FListIdentityProvidersRequest
{
