#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.PC
struct UDecorativeButton3_FriendBox_C_PC_Params
{
	class ALobbyPC2_C*                                 AsLobby_PC;                                                // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.Init
struct UDecorativeButton3_FriendBox_C_Init_Params
{
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.OnUnfriendClicked
struct UDecorativeButton3_FriendBox_C_OnUnfriendClicked_Params
{
	struct FsFriends                                   PlayerToUnfriend;                                          // 0x0000(0x0028)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.OnViewProfileClicked
struct UDecorativeButton3_FriendBox_C_OnViewProfileClicked_Params
{
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.OnPreviewMouseButtonDown
struct UDecorativeButton3_FriendBox_C_OnPreviewMouseButtonDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                               MouseEvent;                                                // 0x0000(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                                 ReturnValue;                                               // 0x0000(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.StatusConverter
struct UDecorativeButton3_FriendBox_C_StatusConverter_Params
{
	int                                                StatusNumber;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FText                                       StatusText;                                                // 0x0000(0x0018)  (Parm, OutParm)
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.GetText_2
struct UDecorativeButton3_FriendBox_C_GetText_2_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.GetText_1
struct UDecorativeButton3_FriendBox_C_GetText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.MenuWidgetCreation
struct UDecorativeButton3_FriendBox_C_MenuWidgetCreation_Params
{
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.OnPreviewKeyDown
struct UDecorativeButton3_FriendBox_C_OnPreviewKeyDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                                   InKeyEvent;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                                 ReturnValue;                                               // 0x0000(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.BndEvt__FriendButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
struct UDecorativeButton3_FriendBox_C_BndEvt__FriendButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.BndEvt__FriendButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
struct UDecorativeButton3_FriendBox_C_BndEvt__FriendButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.BndEvt__UnfriendButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
struct UDecorativeButton3_FriendBox_C_BndEvt__UnfriendButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.BndEvt__UnfriendButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
struct UDecorativeButton3_FriendBox_C_BndEvt__UnfriendButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.Construct
struct UDecorativeButton3_FriendBox_C_Construct_Params
{
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.BndEvt__UnfriendButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
struct UDecorativeButton3_FriendBox_C_BndEvt__UnfriendButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function DecorativeButton3_FriendBox.DecorativeButton3_FriendBox_C.ExecuteUbergraph_DecorativeButton3_FriendBox
struct UDecorativeButton3_FriendBox_C_ExecuteUbergraph_DecorativeButton3_FriendBox_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
