#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.PC
struct ADefaultLobbyPawn_Fix1_C_PC_Params
{
	class ALobbyPC2_C*                                 AsLobby_PC1;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.SetPoints
struct ADefaultLobbyPawn_Fix1_C_SetPoints_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.ToPlayUMG__FinishedFunc
struct ADefaultLobbyPawn_Fix1_C_ToPlayUMG__FinishedFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.ToPlayUMG__UpdateFunc
struct ADefaultLobbyPawn_Fix1_C_ToPlayUMG__UpdateFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.ToGameBrowser__FinishedFunc
struct ADefaultLobbyPawn_Fix1_C_ToGameBrowser__FinishedFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.ToGameBrowser__UpdateFunc
struct ADefaultLobbyPawn_Fix1_C_ToGameBrowser__UpdateFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.ToQuitUMG__FinishedFunc
struct ADefaultLobbyPawn_Fix1_C_ToQuitUMG__FinishedFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.ToQuitUMG__UpdateFunc
struct ADefaultLobbyPawn_Fix1_C_ToQuitUMG__UpdateFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.FromStartToViewCharacter__FinishedFunc
struct ADefaultLobbyPawn_Fix1_C_FromStartToViewCharacter__FinishedFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.FromStartToViewCharacter__UpdateFunc
struct ADefaultLobbyPawn_Fix1_C_FromStartToViewCharacter__UpdateFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.ToLootBox__FinishedFunc
struct ADefaultLobbyPawn_Fix1_C_ToLootBox__FinishedFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.ToLootBox__UpdateFunc
struct ADefaultLobbyPawn_Fix1_C_ToLootBox__UpdateFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.FromStartToViewSpectators__FinishedFunc
struct ADefaultLobbyPawn_Fix1_C_FromStartToViewSpectators__FinishedFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.FromStartToViewSpectators__UpdateFunc
struct ADefaultLobbyPawn_Fix1_C_FromStartToViewSpectators__UpdateFunc_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.StartPointToPlayUMG
struct ADefaultLobbyPawn_Fix1_C_StartPointToPlayUMG_Params
{
	bool                                               Reverse_;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.PlayUmgToGameBrowser
struct ADefaultLobbyPawn_Fix1_C_PlayUmgToGameBrowser_Params
{
	bool                                               Reverse_;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.StartPointToQuitUMG
struct ADefaultLobbyPawn_Fix1_C_StartPointToQuitUMG_Params
{
	bool                                               Reverse_;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.StopAll
struct ADefaultLobbyPawn_Fix1_C_StopAll_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.StartPointToLootBox
struct ADefaultLobbyPawn_Fix1_C_StartPointToLootBox_Params
{
	bool                                               Reverse_;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.ReceiveBeginPlay
struct ADefaultLobbyPawn_Fix1_C_ReceiveBeginPlay_Params
{
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.StartPointToViewCharacter
struct ADefaultLobbyPawn_Fix1_C_StartPointToViewCharacter_Params
{
	bool                                               Reverse_;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.StartPointToViewSpectators
struct ADefaultLobbyPawn_Fix1_C_StartPointToViewSpectators_Params
{
	bool                                               Reverse_;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function DefaultLobbyPawn_Fix1.DefaultLobbyPawn_Fix1_C.ExecuteUbergraph_DefaultLobbyPawn_Fix1
struct ADefaultLobbyPawn_Fix1_C_ExecuteUbergraph_DefaultLobbyPawn_Fix1_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
