#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct F_FXSet.F_FXSet
// 0x0540
struct FF_FXSet
{
	struct FF_FXSurface                                Default_4_6F488895451DDD9C777377B0CADDE6B0;                // 0x0000(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Dirt_7_6AB2C7B048CDCDBD0B283E96ABB3E1E7;                   // 0x0038(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Rock_9_29B9A92342C732D4EB5A2091A7E668AE;                   // 0x0070(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Sand_11_B7CD2F704AF3E238A8694794BAEEF20B;                  // 0x00A8(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Water_13_E7EBEEEC42D4834A500806AE97907A14;                 // 0x00E0(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Glass_15_9DD78BA449E3275A69CC9BB8141AD39F;                 // 0x0118(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Cloth_21_EF56ACCF4FA25EC7CE10D2A214618D20;                 // 0x0150(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Metal_22_ED3E37E54BE4AC4C06C8F6AA8565312D;                 // 0x0188(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Wood_23_6F16066B4AC3BB114625408E1CAB8914;                  // 0x01C0(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Grass_24_FE871AD94A0CE15753A0F1AA01B56A4B;                 // 0x01F8(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Carpet_25_72F3E0CA4725AE971D366C93487AD667;                // 0x0230(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Concrete_29_FB0EAFD74B1CE8A48F88B6A7763B7912;              // 0x0268(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Snow_30_6EC04F0046F78171A53195A6F3FE3FAA;                  // 0x02A0(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Tile_31_6581094944AE9A28EF812FB82903E15B;                  // 0x02D8(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Asphalt_35_105F36104709FC8CBB099099084F8588;               // 0x0310(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Brick_36_FEEB978C4C294804A9AB2FACEC4A681B;                 // 0x0348(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Cardboard_37_160FFEB6464CF00AF840B88D3DE902B1;             // 0x0380(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Clay_41_151ADF59452CEA48F6353DB7EA31B080;                  // 0x03B8(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Plastics_42_A424492E4F8A1ABC49FC56968E7E52C4;              // 0x03F0(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Electronics_43_8E61EB3E4D0E2E5C32F3409E0EEAB366;           // 0x0428(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Sheetrock_47_35600FC546FBB714235DF681920132CD;             // 0x0460(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Plaster_48_78A8FDAB423F9DFB0EE0C68203E924A9;               // 0x0498(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Leaves_49_74CC5E1B4371C44CAED20080BCF68DB6;                // 0x04D0(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_FXSurface                                Blood_51_C0A4BA5242C680F57E5CD6893D622353;                 // 0x0508(0x0038) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
