#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass FPP_Anim.FPP_Anim_C
// 0x270D (FullSize[0x2975] - InheritedSize[0x0268])
class UFPP_Anim_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_FK1B[0x8];                                     // 0x0268(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0270(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_FCFC4984454694B3BD5309A180FFEBC0;       // 0x0278(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_885CBAD84D66D591DAC7BEA34A0B860D; // 0x0298(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C00CB200443FC36BBC287DB03DC74664; // 0x02C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_438ED56446995830D4ECE3AA41E249ED; // 0x02E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A282FA764B8C92F2519214A2211FB2AA; // 0x0310(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E259DAF145C8585DFBCA088A737544B6; // 0x0338(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67EC4B3E49E4CD6123BFAE85A6692443; // 0x0360(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C78C48AC4C64C4EBDDF8BD8B2B10377D; // 0x0388(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B06751D0401195C4AA7EBF827E2081B1; // 0x03B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_789714034D7A51A1688B27B50DCBF66A; // 0x03D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_214532BA435FAEFE297691A0C5DF45E3; // 0x0400(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C0DE3AE34A5E1A6D73C40085878E0404; // 0x0428(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_648D342845DF8C6B9FD4E3B4058A5D82; // 0x0450(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DFC52CB0406906231FC5FDBDFADA70F4; // 0x0478(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4480EF2D4C1A99257DFD70BC88BCAED7; // 0x04A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7FD7D7BF48B5A1674619B7A35B5FDA5C; // 0x04C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46F773A04C204148F5A22EB368D8318A; // 0x04F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3E082DB24F4A187579CA5D84F172536D; // 0x0518(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0E6FC5E41BEBA42BD509E82FFFA0D2A; // 0x0540(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D8B7D75457DECBA27CC1694BFEC7F43; // 0x0568(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B40E2994169E6FEC8309EB509688530; // 0x0590(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1886FC4A454C861B21E1C6AF38D5A124; // 0x05B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C446AF6A4D3CEF4812F6FFB5FC696D80; // 0x05E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_161A8BDB4E7FB0C99029D3A111B6FB35; // 0x0608(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_044A88304A0C5BEA1C8C3690E4DC4D60; // 0x0630(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DF9EE9EC42B2C8784797F780D676EB74; // 0x0658(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EB6ACC1A4E285BAFC899F69D02858ADB; // 0x0680(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9B140B741DD4685533F78ABC518A2EC; // 0x06A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2293B6B3465D86F86F9FA9A23F96B451; // 0x06D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A556EDB4FD147BBF88CE3BCDF8D7B69; // 0x06F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1C695B954E1EEFA22EC6F990ACFDAB44; // 0x0720(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5545AE042246EC1BC7153932D5B44F0; // 0x0748(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7AD9DAF74A758A68EA46E88A49FB8389; // 0x0770(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F43EF15D4367A9E349B29DA3B3A310D7; // 0x0798(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC09C5F84897FDCC46C50E9C7A256B2F; // 0x07C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5E34825E434ACD5D28DB4AB09DC8704D; // 0x07E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_28C8050247A3CF79E2C01AB85DFBA688; // 0x0810(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2A576D4344434F5C5D12909FA2D600B9; // 0x0838(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_29272A0F4FE21FF40BBE6687946E846A; // 0x08B0(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CA40937E4448232F87C698B6CAEE8D88; // 0x08D0(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_96BD7AA94F6FA0D7D47E98AFBB22AF85; // 0x09B0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E233FB484F4BDDF97C87E88B56D1DDBB; // 0x09D0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_299C88D84A3F88CF9750E292F5FC39D7; // 0x0A48(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_BB458D6C441CB0AE7CEA5C96FC49249C; // 0x0A68(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5DBCBAE149F4F122512E3181A5E9D16B; // 0x0B18(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71E31F5E4BC1F850264F378875E650CD; // 0x0B38(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30A130D64BB585E8152F499B4B483C8D; // 0x0B60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ED3E00A5432E515B352465B9E8027E95; // 0x0B88(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_412F4711477B60A2ACA717B3404E9DF8; // 0x0BB0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE81691B462CA6602B5DFF81AE8E34ED; // 0x0BD8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0215720345B7576124D70B815621F4F4; // 0x0C00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_990B0E5A4833B3DCF1412799DA018C12; // 0x0C28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E8C313AD4EB543D1118B4B8AD76DAD70; // 0x0C50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_39A65B224BF8DA0DFCB86EAA8FD10B60; // 0x0C78(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_399F93B24CE46A9016120888C97A1AE2; // 0x0CA0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C54F982469BD1CDCD297B98154AC706; // 0x0CC8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C1EFDC074B43CB9AFA13D5B8B5DA07BC; // 0x0CF0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_475433AF4CFEE157A48C11B8C9B36A09; // 0x0D18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2AA0FBA540837AE4E5DC1AB11CEDE647; // 0x0D40(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7EB01AF042E804C70F2BD68966B3BE4F; // 0x0D68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BED1AB1D46512DE8E9FB1C93FA6D398D; // 0x0D90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_913D471F4C54A5A310FEF88C63DF987E; // 0x0DB8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_209278DD4A5A27AA885841BD47450325; // 0x0DE0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AD6027CC4945BE227D54FDBCEC78E4F0; // 0x0E08(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_87BB8618462B99E024C3D298EF0ED61B; // 0x0E80(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A2D9D73C41CFADA2A3FED8BC67532A11; // 0x0EA0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8B4AB5384F19A57EDDA137B4C39AD464; // 0x0F18(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_39C0276546084E7503AA99B98F113E66; // 0x0F38(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DC9BAB804D74B41AD8F665B8788AD5D4; // 0x0FB0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2C01237E4F3436612E5049B07D475AAC; // 0x0FD0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_510A9B4444B6E896A45DC4B75FF001C2; // 0x1048(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A5F3EF94012D067B7D18F88B23D747F; // 0x1068(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B39DC1524559B1EE8B82848B540BBBAD; // 0x10E0(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0A7B2305414BDE10A20CC980D05A50E1; // 0x1100(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D6F8699947A0B0E02FE9EE8C25E91672; // 0x11E0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1D72AD3949B2569B17182D84647AB431; // 0x1200(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DCBCFE1D429B04A366EEF4B374EE1E23; // 0x1278(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D49F474B4B90877375EC389808BB2C7E; // 0x1298(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_12CF191D43DA0C08A78455AEC71AFCA5; // 0x1348(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0085050445951A6D41CED5AB095B39D6; // 0x1368(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CEB728114F779DFED03CB7B9FE374F0F; // 0x1390(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D929ED5C46F7DE5953AFB39787526A67; // 0x13B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_398AF0E9437219773EA0A6B07BBFFE64; // 0x13E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_544B99BA4A560E9A76E708963FEB9985; // 0x1408(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A4C8AE31490B739122E756AEA613D3B1; // 0x1430(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_853F093B4F300C41A9A197809F7FE0C1; // 0x1458(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F114D8D47153E517533ADA6E23566E3; // 0x1480(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_310CEB4A49E501F25D1AFAA26BBE39C6; // 0x14F8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_414A0FAB460820266BB25895D4410DB3; // 0x1518(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CED2508C4023F78483B619BA876E8265; // 0x1590(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F6DDA7C943B305CC97D9B0B665ED1726; // 0x15B0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DDA78FC04C8F982368D94991DED1C8D9; // 0x1628(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9C71488F409BCE4E958925AA7326815A; // 0x1648(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1DE4F5C54E7F1BE713914A9162888608; // 0x16C0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7C9942D5494BC2CBACE3DFAA2CBC9583; // 0x16E0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_855854924754E0BDECFD45891A6AB2FE; // 0x1758(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5B42E5024791D82C46CAE399C9EA7CB6; // 0x1778(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E4B47E9A49696612783309872779BABC; // 0x1828(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_070768834278E8FF3EF878879949E8F4; // 0x1848(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1212B51A47986469BDEF2687245AD935; // 0x1870(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1E5A8E444033743A327EF7A8DD298D71; // 0x1898(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_491FADA2491A78EB60EFFF9BC6EABE01; // 0x18C0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4662090C49D3CE81A9ACDABB275FFB64; // 0x18E8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F07BF81B492874461FB3EB86948FBE4C; // 0x1960(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D3545A58435056BBA71B1B9A0B7FBCCC; // 0x1980(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B988E64F4352832CD6C2BA8BD26673CC; // 0x19F8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3C160C114B3EC671D8EB4E8BAAF040DB; // 0x1A18(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_ED0FE2A44C6D30F0DBB87382CFB3D01D; // 0x1A90(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_227FE564411B6AD80494F3856DA5BE47; // 0x1AB0(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1C21DD244DCD4039499312AA3E290258; // 0x1B90(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2A409E224AE165BE7E3B84B889209FB4; // 0x1BB0(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_62599873417B6A17A86FC28A8208DAC5; // 0x1C60(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B7B3D60B4C49A9DF375F2592A6F5AC6C; // 0x1C80(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4241BDD8412AFB1003D006A41B4B67A2; // 0x1CA8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C379818C41331F8B081BA080E0CE456A; // 0x1CD0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1AE819C941EFB1CE0DEF71A4393D512A; // 0x1CF8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F5627CD8432F814EB65E7E8E7065A003; // 0x1D20(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_488580E04C679323A536D59D3E558CFF; // 0x1D48(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_549354894B155397EFCE5AA7083EA84B; // 0x1D70(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2539884C4DE55F1B82865DAD7A7D3DEA; // 0x1D98(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FB84602A41A0561F326806AFB89915B3; // 0x1E10(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D54104FF4A7E7DF072AABEA1D0746682; // 0x1E30(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5294A4904DDB7391BA26A988A9237F16; // 0x1EA8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_250328A64241A7E1C4B33D9B3FB7476B; // 0x1EC8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3CD448834F5E15EA9A55B8B487E69DB6; // 0x1F40(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D05CDB1A4C26C853B461FD8EAEB55641; // 0x1F60(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A7F76F6E43A791369450D99584107E55; // 0x1FD8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_49EE0EFB4DD8ED58CD9C9F99F8F36D64; // 0x1FF8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CB59FE22483B51DAD3137CA4B2937946; // 0x2070(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4E0F96A741A31DBC80D9339D5EF4A3D3; // 0x2090(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5F51699942244271A22104986A24A68A; // 0x2140(0x0020)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_2685BB894899EC9372F037B94D830EFD;     // 0x2160(0x0190)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_19A3DC56451AD39A770605B2CF727A4D; // 0x22F0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_6ED50BE24DB92BCFB19B96A5D38F8898; // 0x2310(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E8B7F524472074840C966AF6D1B8627; // 0x2330(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0ADB0C5B49A89C0690BDEAAA6F085ECF; // 0x2358(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23D9B9B04046FABB0A4C95AA83123DF3; // 0x2380(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44AC0D354A524F7308B762B1E74B1D17; // 0x23A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71C99F9245271F1C2B69D5A30007FD93; // 0x23D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_466F99BC43CF3BD2E41F79A36F850561; // 0x23F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5609E6448E528D4930E9B12B2F62F3; // 0x2420(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AC12FC2944A881181142EFA179891817; // 0x2448(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4D50884D49285D4F8C649AB8B0558DE2; // 0x24C0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C43B4C81460D3BB75D45AAACA150DCF6; // 0x24E0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1F77B52B407B7A251EB725A8076872EE; // 0x2558(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0D8B605A47EAA5153F9CB6B0C67BA95E; // 0x2578(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E7946DF844D3F477BC6166A729E03E7B; // 0x25F0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_80CCFAA2470B16B2401C1891423694A3; // 0x2610(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E86045414DC85A8AB32878ACDC435706; // 0x2688(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E3EA7A474CE92E156854EC9113E9E39B; // 0x26A8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D87E0AAC4AFE094ECC0598ADDCFD4488; // 0x2720(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6A1334B74E8FC40BD290AE8ABB0437A8; // 0x2740(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_16563A65417D34183FD1F7951A454018; // 0x27F0(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0BFB1A4845AC409AD957A492CEB69152; // 0x2810(0x00B0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_7EBD8F0F4609D8F8EA62E8B6C30276A4;       // 0x28C0(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_A24F58AC49B5081D15C11585FD728F2D;       // 0x2908(0x0048)
	bool                                               IsMoving;                                                  // 0x2950(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bIsInAir;                                                  // 0x2951(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_WFZE[0x2];                                     // 0x2952(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     HandPosition;                                              // 0x2954(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFPS_Character2_C*                           Character;                                                 // 0x2960(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TEnumAsByte<WeaponList_EWeaponList>                WhichWeapon_;                                              // 0x2968(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	unsigned char                                      UnknownData_7QJP[0x3];                                     // 0x2969(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Speed;                                                     // 0x296C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Direction;                                                 // 0x2970(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsGrenadeReloaded_;                                        // 0x2974(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("AnimBlueprintGeneratedClass FPP_Anim.FPP_Anim_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPP_Anim_AnimGraphNode_TransitionResult_71E31F5E4BC1F850264F378875E650CD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPP_Anim_AnimGraphNode_TransitionResult_ED3E00A5432E515B352465B9E8027E95();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPP_Anim_AnimGraphNode_TransitionResult_1D8B7D75457DECBA27CC1694BFEC7F43();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPP_Anim_AnimGraphNode_TransitionResult_0215720345B7576124D70B815621F4F4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPP_Anim_AnimGraphNode_TransitionResult_990B0E5A4833B3DCF1412799DA018C12();
