#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function InvenList_09_Spectators.InvenList_09_Spectators_C.PC
struct UInvenList_09_Spectators_C_PC_Params
{
	class ALobbyPC2_C*                                 AsLobby_PC1;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function InvenList_09_Spectators.InvenList_09_Spectators_C.BeginplayUpdateList
struct UInvenList_09_Spectators_C_BeginplayUpdateList_Params
{
	int                                                Default;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function InvenList_09_Spectators.InvenList_09_Spectators_C.SetToDefault
struct UInvenList_09_Spectators_C_SetToDefault_Params
{
};

// Function InvenList_09_Spectators.InvenList_09_Spectators_C.UpdatePreview
struct UInvenList_09_Spectators_C_UpdatePreview_Params
{
	int                                                ItemNumber;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function InvenList_09_Spectators.InvenList_09_Spectators_C.UpdateList
struct UInvenList_09_Spectators_C_UpdateList_Params
{
	bool                                               Upload_;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               SyncAsDefault_;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function InvenList_09_Spectators.InvenList_09_Spectators_C.GI
struct UInvenList_09_Spectators_C_GI_Params
{
	class UGI2_C*                                      AsGI2;                                                     // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function InvenList_09_Spectators.InvenList_09_Spectators_C.OnParentConstruct
struct UInvenList_09_Spectators_C_OnParentConstruct_Params
{
};

// Function InvenList_09_Spectators.InvenList_09_Spectators_C.ExecuteUbergraph_InvenList_09_Spectators
struct UInvenList_09_Spectators_C_ExecuteUbergraph_InvenList_09_Spectators_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
