#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function InvenList_07_Items.InvenList_07_Items_C.PC
struct UInvenList_07_Items_C_PC_Params
{
	class ALobbyPC2_C*                                 AsLobby_PC2;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function InvenList_07_Items.InvenList_07_Items_C.BeginplayUpdateList
struct UInvenList_07_Items_C_BeginplayUpdateList_Params
{
	int                                                Default;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function InvenList_07_Items.InvenList_07_Items_C.SetToDefault
struct UInvenList_07_Items_C_SetToDefault_Params
{
};

// Function InvenList_07_Items.InvenList_07_Items_C.UpdatePreview
struct UInvenList_07_Items_C_UpdatePreview_Params
{
	int                                                ItemNumber;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function InvenList_07_Items.InvenList_07_Items_C.UpdateList
struct UInvenList_07_Items_C_UpdateList_Params
{
};

// Function InvenList_07_Items.InvenList_07_Items_C.GI
struct UInvenList_07_Items_C_GI_Params
{
	class UGI2_C*                                      AsGI2;                                                     // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function InvenList_07_Items.InvenList_07_Items_C.OnParentConstruct
struct UInvenList_07_Items_C_OnParentConstruct_Params
{
};

// Function InvenList_07_Items.InvenList_07_Items_C.ExecuteUbergraph_InvenList_07_Items
struct UInvenList_07_Items_C_ExecuteUbergraph_InvenList_07_Items_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
