#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function Menu_Friend.Menu_Friend_C.PC
struct UMenu_Friend_C_PC_Params
{
	class ALobbyPC2_C*                                 AsLobby_PC;                                                // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Menu_Friend.Menu_Friend_C.MenuWidgetCreation
struct UMenu_Friend_C_MenuWidgetCreation_Params
{
};

// Function Menu_Friend.Menu_Friend_C.OnPreviewKeyDown
struct UMenu_Friend_C_OnPreviewKeyDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                                   InKeyEvent;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                                 ReturnValue;                                               // 0x0000(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function Menu_Friend.Menu_Friend_C.Get_Subtext_Text_1
struct UMenu_Friend_C_Get_Subtext_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function Menu_Friend.Menu_Friend_C.Get_Text_Text_1
struct UMenu_Friend_C_Get_Text_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function Menu_Friend.Menu_Friend_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
struct UMenu_Friend_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function Menu_Friend.Menu_Friend_C.BndEvt__UnfriendButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
struct UMenu_Friend_C_BndEvt__UnfriendButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function Menu_Friend.Menu_Friend_C.BndEvt__UnfriendButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
struct UMenu_Friend_C_BndEvt__UnfriendButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function Menu_Friend.Menu_Friend_C.BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature
struct UMenu_Friend_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function Menu_Friend.Menu_Friend_C.Construct
struct UMenu_Friend_C_Construct_Params
{
};

// Function Menu_Friend.Menu_Friend_C.OnFocusLost
struct UMenu_Friend_C_OnFocusLost_Params
{
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function Menu_Friend.Menu_Friend_C.ExecuteUbergraph_Menu_Friend
struct UMenu_Friend_C_ExecuteUbergraph_Menu_Friend_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
