#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function PropSelectionUMG.PropSelectionUMG_C.RandomSlot
struct UPropSelectionUMG_C_RandomSlot_Params
{
	struct FPropList                                   RandomPropInfo;                                            // 0x0000(0x0060)  (Parm, OutParm, HasGetValueTypeHash)
};

// Function PropSelectionUMG.PropSelectionUMG_C.UnlockSlot3
struct UPropSelectionUMG_C_UnlockSlot3_Params
{
	bool                                               Unlock_;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function PropSelectionUMG.PropSelectionUMG_C.UnlockSlot2
struct UPropSelectionUMG_C_UnlockSlot2_Params
{
	bool                                               Unlock_;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function PropSelectionUMG.PropSelectionUMG_C.Init
struct UPropSelectionUMG_C_Init_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.StartRolling
struct UPropSelectionUMG_C_StartRolling_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.BlockSelecting?
struct UPropSelectionUMG_C_BlockSelecting__Params
{
	bool                                               bLock;                                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function PropSelectionUMG.PropSelectionUMG_C.ResetMainVariables
struct UPropSelectionUMG_C_ResetMainVariables_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.ResetRollTimerVariables
struct UPropSelectionUMG_C_ResetRollTimerVariables_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.ChangeChooseButtonText
struct UPropSelectionUMG_C_ChangeChooseButtonText_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.CountDownNumberOutput
struct UPropSelectionUMG_C_CountDownNumberOutput_Params
{
	bool                                               Done_;                                                     // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int                                                CountNumber;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function PropSelectionUMG.PropSelectionUMG_C.ClearTimer
struct UPropSelectionUMG_C_ClearTimer_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.GI
struct UPropSelectionUMG_C_GI_Params
{
	class UGI2_C*                                      AsGI2;                                                     // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function PropSelectionUMG.PropSelectionUMG_C.PC
struct UPropSelectionUMG_C_PC_Params
{
	class AFPS_PC_C*                                   AsFPS_PC;                                                  // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function PropSelectionUMG.PropSelectionUMG_C.InitializePropSelectionUMG
struct UPropSelectionUMG_C_InitializePropSelectionUMG_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.Ticking
struct UPropSelectionUMG_C_Ticking_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.BndEvt__Option1Image_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
struct UPropSelectionUMG_C_BndEvt__Option1Image_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.BndEvt__Option2Image_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature
struct UPropSelectionUMG_C_BndEvt__Option2Image_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.BndEvt__Option3Image_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature
struct UPropSelectionUMG_C_BndEvt__Option3Image_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.StartSlotRoll
struct UPropSelectionUMG_C_StartSlotRoll_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.RollTimerTick
struct UPropSelectionUMG_C_RollTimerTick_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.Construct
struct UPropSelectionUMG_C_Construct_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.BndEvt__ChooseButton_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature
struct UPropSelectionUMG_C_BndEvt__ChooseButton_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.OnCancelSelection
struct UPropSelectionUMG_C_OnCancelSelection_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.FinishRolling
struct UPropSelectionUMG_C_FinishRolling_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.BndEvt__Option1Image_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature
struct UPropSelectionUMG_C_BndEvt__Option1Image_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.BndEvt__Option1Image_K2Node_ComponentBoundEvent_1_OnUnhovered__DelegateSignature
struct UPropSelectionUMG_C_BndEvt__Option1Image_K2Node_ComponentBoundEvent_1_OnUnhovered__DelegateSignature_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.BndEvt__Option2Image_K2Node_ComponentBoundEvent_2_OnHovered__DelegateSignature
struct UPropSelectionUMG_C_BndEvt__Option2Image_K2Node_ComponentBoundEvent_2_OnHovered__DelegateSignature_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.BndEvt__Option2Image_K2Node_ComponentBoundEvent_4_OnUnhovered__DelegateSignature
struct UPropSelectionUMG_C_BndEvt__Option2Image_K2Node_ComponentBoundEvent_4_OnUnhovered__DelegateSignature_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.BndEvt__Option3Image_K2Node_ComponentBoundEvent_8_OnHovered__DelegateSignature
struct UPropSelectionUMG_C_BndEvt__Option3Image_K2Node_ComponentBoundEvent_8_OnHovered__DelegateSignature_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.BndEvt__Option3Image_K2Node_ComponentBoundEvent_9_OnUnhovered__DelegateSignature
struct UPropSelectionUMG_C_BndEvt__Option3Image_K2Node_ComponentBoundEvent_9_OnUnhovered__DelegateSignature_Params
{
};

// Function PropSelectionUMG.PropSelectionUMG_C.ServerCheckedValidCurrency
struct UPropSelectionUMG_C_ServerCheckedValidCurrency_Params
{
	int                                                TrialNumber;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function PropSelectionUMG.PropSelectionUMG_C.ExecuteUbergraph_PropSelectionUMG
struct UPropSelectionUMG_C_ExecuteUbergraph_PropSelectionUMG_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
