#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct SCashItemsGameInfo.SCashItemsGameInfo
// 0x0008
struct FSCashItemsGameInfo
{
	bool                                               GameLicense_16_D8CDCC0B4B22D5F650984B80867B2B05;           // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               _2ndSlot_6_BD1ECA3A47DE186D074CECA77976FA30;               // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               GoldPassLight_7_157BD0C4466740F30608F1A5C3BD746D;          // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               GoldPassStandard_8_F66DF2F9416D48193E6B1FB10CCE39AB;       // 0x0003(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               GoldPassDeluxe_9_8D410D484E3DEF6809FFE091693A1DF0;         // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               _3rdSlot_11_3E305A994680D7D633D5C1BA74586299;              // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               PropBooster_13_97DE18A242CCE505C5F3AAA06A46CACD;           // 0x0006(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               EarlyAccessLicense_15_EB1DDC1E4AA14D8475ED67A5ACFB9245;    // 0x0007(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
