#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass TPP_Animation.TPP_Animation_C
// 0x96AD (FullSize[0x9915] - InheritedSize[0x0268])
class UTPP_Animation_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_4CT2[0x8];                                     // 0x0268(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0270(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_0C0304664E5D637E777F8F82B80BDD47;       // 0x0278(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3CD7CBF441C7DDA5CFF9E4A65DD6376D; // 0x0298(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_90CFBB1D4CE6A6C749E99F9DDE2DB232; // 0x02C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3671A24147823B24EEAD169C3B3B05D3; // 0x02E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2A103ED14851CC761C84CBB8D2411540; // 0x0310(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ADF8820E4B4B8FAACD5CE89EF50D0207; // 0x0338(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6729743A4A2B836021BE1B99CB7EAE3E; // 0x0360(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_174D495E457243FC017E44954EF9FB40; // 0x0388(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D502425649C8F642B53C7A850D00B512; // 0x03B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D2812F0648E87D4A9B9C918138FC1660; // 0x03D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C479BEF4EAE39C9FA5ABE935D7D80F5; // 0x0400(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48C5F09240FB593D7A0225B6A3CFC7F5; // 0x0428(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_09B8B9E24D31FF1FB99BCB9B34F379A5; // 0x0450(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A5F8E65545CCC291A97E2A921528C507; // 0x0478(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_837A05E349C0810468173CBEB8CECF5D; // 0x04A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17977A3D41C7F3F3211BDDB0A128AEEB; // 0x04C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2D3CD4C547952E1D554CEF932D88BD3D; // 0x04F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F4B61FAD4ECB3A32834F4A8672A95B49; // 0x0518(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B20791B54E3D5A947807C2ABCF5C84B0; // 0x0540(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32B0526D4BC83531BE95DF81437C4089; // 0x0568(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2EE00CF84DC0BAF6D4A03681DD7A347E; // 0x0590(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F9B84CEC42A6E351641D4E8F2C65BEFF; // 0x05B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C04C444C4FC21E45FD65FFBEFFE3AC12; // 0x05E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5587CED44685D08957473F8901BBABB6; // 0x0608(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A25C2CF847040C4A4D0328A0614687FE; // 0x0630(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_886E682546226D15842C42A2BDC9583B; // 0x0658(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F0B4681D430D774FEBA63985F6894334; // 0x0680(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A85B72C445DC7104A3E03FAF34191E11; // 0x06A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_986F219148839A6B66CB42B15DAAA3F1; // 0x06D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AFDF925242CBE782DA73E597B4DABB8E; // 0x06F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B20FB6C45F4BE66D91C928E0FC58242; // 0x0720(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C6F6522B47AB53A4617977954DED72F6; // 0x0748(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFD69CAE432DCDE02826FDB2827E62BC; // 0x0770(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8244079F450BB122AD285BBF6F765CD1; // 0x0798(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1CF1314A422307820F6B898FACB18310; // 0x07C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E6A7428945B53C044FFAFBBCE4AD722C; // 0x07E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8217B023490F318D9AE4C9B4830A0970; // 0x0810(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_86BDEE524DC914F709A02DB8029B8996; // 0x0838(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1A6261242572E367FFE88A17B426737; // 0x0860(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8AF8509647458BBF4574979F4884C325; // 0x0888(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A556A1404BEB11982B8814B579E7698D; // 0x08B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BBF5546847CDF52404F74B93F0AA5C2A; // 0x08D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_383E8D894B8AF55D068834A495103E6C; // 0x0900(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF435DE34C86B3C29C53508006CFFDD0; // 0x0928(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_317A92D04472C40E731436A5FB46458D; // 0x0950(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1E95364443967742DE2AC9D7E49A764; // 0x0978(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1313F1D4D145F41A4B911B5EC3E4342; // 0x09A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43408C734CC601C13994EBBFB0B0A9DE; // 0x09C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41F53D0A45042D93E88E00BCF6BF9166; // 0x09F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_95F3E7E248F1AA551EA13DB95C4DAB44; // 0x0A18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DBD7128846BBB63F32E489A0C3FA8B93; // 0x0A40(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10AD79F94933CCC481A855A7DACAD8CC; // 0x0A68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A1E019344F0E17C2EF3A82875DAB745F; // 0x0A90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7261B6ED43AE7FA720038CA37F7285B4; // 0x0AB8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40F55B6F4925D35824AEE88EDD2C1237; // 0x0AE0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B54006214397CD17F86D1AB8E1718C77; // 0x0B08(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C78DC07F42D3D98C1F6FA6A0E8911AB1; // 0x0B30(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DACD4E2147A12F7470DB4CB8D8747FE9; // 0x0B58(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_183192334686BA7A7D9345A3DDB05195; // 0x0B80(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E4F2F177469E4FA7D8ADC3820CD5B671; // 0x0BA8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF4D2051422E27BB02904695B20E6749; // 0x0BD0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD6C262A4B7815E5BFB102A3BBDFBC8D; // 0x0BF8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_68302782425DDED0DD499D88B89CB2C7; // 0x0C20(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_768597CE4B44EE677D0BACADFE937538; // 0x0C48(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD718CE7463F39557D9AF08F0037B670; // 0x0C70(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1C923C241DE11749B0947B0F12D764D; // 0x0C98(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93C398B9465083273B96E3A47584F55F; // 0x0CC0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7929E883489C4876042BD0A03142BBC3; // 0x0CE8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3E33D7874A20249671160EA5BD705099; // 0x0D10(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6D057C5F47F000EEFFA5ABAF5A4DA9DB; // 0x0D38(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_84E46376479BC1A2299055A6ECCF0836; // 0x0D60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC86B8DD4801F8516BE0EB8984ADEC5F; // 0x0D88(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14364A2948D3EBF8B2E9818B26F11CBD; // 0x0DB0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC491F4E477A4F6FDF254697F8064416; // 0x0DD8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1681FDA64352FED4CEFFA5BE7AE27144; // 0x0E00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3F25E73F4E17DC2A0442D98904F9CA27; // 0x0E28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F469C7E34170254FE9324ABC57077C96; // 0x0E50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_950118CC49C46EE7C06D248863D768AD; // 0x0E78(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_937985C447855C796B2B7A90D3243E34; // 0x0EA0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BB3FDFD848AEBA74CE9881A40D12E87C; // 0x0EC8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8488ED4C4A242C95F47820BCFEDA2D8E; // 0x0EF0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5DEE1CD34CDEF852518C06B5F075C7E2; // 0x0F18(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BD1CF0C2462D5D0C3EAE73B0C745917D; // 0x0F40(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B1AD978B4C965130946B1EABB2E8BADC; // 0x0FB8(0x0020)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1FCE5ADD4729D74CB34A6BAD2BE4FA7B; // 0x0FD8(0x00B8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2F0677654E210045D6A1968FC4252840; // 0x1090(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_03738B954C413EC5E4A563AEF4932839; // 0x1170(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3F3B677B4C340D06B037558C4D5E2435; // 0x11E8(0x0020)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_ADC7001F4C514AA4CB4D1BB666FB03A0; // 0x1208(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB109D1E48637E340911FDB7447B205C; // 0x12C0(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FEB38941407C24A78CEA64823FFB650D; // 0x1338(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_51541E8C4E6D3445B28AA397F0E03955; // 0x1418(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10416BAC47EAE571686CC7A5F31C4DE6; // 0x1438(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E039C1EB4D14D81C2AFD53977CEB8443; // 0x14B0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_89212E744F4083CDD185E694B8127EAF; // 0x14D0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_BB1CA0C940A25D847C027FA14679BE8D; // 0x14F0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_10372D794E39FE95C13CF3A317891F6E; // 0x1510(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AC91CB06496B57A6D30CEC86043402F2; // 0x1618(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3085E5F84DBCC1F0F71C6A95AD004217; // 0x1690(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5B1C5E5840FAFDB3379B6586B282BA9D; // 0x1748(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EA40323E482BAFB2CBE268B88B1F85BC; // 0x17C0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5065ABED4377A54669F8DCAA63B3A5B8; // 0x17E0(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_CF4BE6A74AEBB6F1D0C20FA210D40847; // 0x1858(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4B3F0F3145968F3CA6C2D98805C8386E; // 0x1910(0x0078)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_7522FCC84ADA6CAFA576019A49C2FA75; // 0x1988(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_69FC99374717417F18F533B6B2067603; // 0x19A8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4AA26F1640DAC4CD9F5CA2BB96E48C6A; // 0x19C8(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_554B423E46607036E3397A8171D748B9; // 0x1AD0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_39DF1DD2466BCB9CA1182DB1EAF7D71E; // 0x1AF0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2A6054124B7D931BCC1ED4BF1857C57D; // 0x1B10(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3F9F6A6D4A58A3C97FDB27B96AE84952; // 0x1B30(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2388CE554DE8BC1F6308578121E37CAB; // 0x1C38(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_DC06746C485195356B66479B395A4FB1; // 0x1CB0(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_32F2BBD4436BAD0C6D44678B02B1BE60; // 0x1D68(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_27EE934E4E7357D8A1B02BB12DAAD913; // 0x1DE0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6E21D0164ED163D77E4CBB9086391605; // 0x1E00(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B08DD7884F3F0DAEFD17DABF452D4216; // 0x1E78(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7C6A6435448180FBF75310AD8154E25F; // 0x1E98(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_603AA1864613544FB0C575827B1C853E; // 0x1F78(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4D74FFDE47956716A77E43BB78A5AA2B; // 0x1F98(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DDB916154385ED40ECB03E8045B0068B; // 0x2078(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2028F9644D045608C369FD9A0C451590; // 0x2098(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_96486F92410A385D3DB0B8A270E8D810; // 0x2110(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_630B8B8249FFC4639FC0FD986F6AE2CF; // 0x2130(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3714B1164E038152041704984D183D5D; // 0x21E0(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4ECA8EC54E1C490E8717DD9CA175975C; // 0x2200(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_82B5334A45A608B73B36FD857AC17874; // 0x2228(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_69E1E0E149BBDD036E6E8AA5CF977265; // 0x2250(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DDF5AAC344F682F3E770FB841397409E; // 0x2278(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_70219637413BBCA4C7A37F937E4EC279; // 0x22A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DDBB394043F29F5ABD3C9FAA84C47AC7; // 0x22C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_61527D554F4BD9DCF031E7AF605E2557; // 0x22F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CEADD67141B094BB56A75899F75DE3F2; // 0x2318(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E4E44FFE45FB9898BFD18EA2F8393BAC; // 0x2340(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_09106D8E4B9513CE5ED305B35EB8028C; // 0x2368(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B6FB0A5A4D8C58BEBC5FE8843A0BE5C5; // 0x2390(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D1B62EE041C1ED907297D4A6E87AD58D; // 0x23B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1304573844C2B524CC84C19B1ECB7494; // 0x23E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33C14FFB460BFFD184AF8FB4255F42C9; // 0x2408(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D29D7DC54ACAD55FC18739B0CD95C225; // 0x2430(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE5686B5405E0CED219A1D873B1B7113; // 0x2458(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A136119C401E7EA1F398D2B9F25E7BB4; // 0x2480(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47D4241145179F0B4B5A53A8A2F0C467; // 0x24A8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B0907B274741CC7B96AA13B027A63576; // 0x24D0(0x0078)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_4AE455A44E944EA2684B0E965296A0D0; // 0x2548(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_5B4E1EBF4F6425092B725CB28FA270A7; // 0x2568(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6B48C37A410D866CC0EC7BAB16A16437; // 0x2588(0x0108)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_F4CA7E544979ADDA9C83C18186A12F68; // 0x2690(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A7918E442ED1038E10D6786AF252B66; // 0x2748(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_54569FF04C392E98E06AC3B51957DBC5; // 0x27C0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BF95B87D46537154B3071B9330C1DCF2; // 0x27E0(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_ABFB858947C8D278E6F6CFAB2EBE601F; // 0x2858(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2356CA804EC4F63DD0A2078E2D83D1FF; // 0x2910(0x0078)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_15EEA5D143D96BE7AEF2FF90FA997BBA; // 0x2988(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_8D7DE834485C7D1EB38A95985935DF0A; // 0x29A8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6663B9B3440B86DF24400091FD6B5D42; // 0x29C8(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5F70BBB44D19916ABC037BB7A5787DA5; // 0x2AD0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_A2B5D21B4E0A2B9FF090B3A25DF65580; // 0x2AF0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4495B3D64270B2865EC07D8760B0E479; // 0x2B10(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9C01D92341D5E07E362A209F2361A28E; // 0x2B30(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_293311524A08536A7E870EB497A2A98A; // 0x2C38(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_858B75724C7D2EAB945CA6BC9FE1AC7D; // 0x2CB0(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8139890D461AA1AD351DB2904A897F64; // 0x2D68(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_183B97CB4A3341B0ED76EB8399D321FB; // 0x2DE0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E43621FC4692670BF8DD8890A5C46C42; // 0x2E00(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C2653B684936DA2D68586DBC71278967; // 0x2E78(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9D648C7B4C802CA251D60DA81B1D014B; // 0x2E98(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_615055F046E73E2B276663BDB3EED427; // 0x2F78(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_57FBC1D6495EFA6CB29C8CB685EBAF44; // 0x2F98(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DE15C00040C840D3C8114F952D416108; // 0x3078(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_462AB28E4701875CAAB50597C6B86BCE; // 0x3098(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4553DD664BB93CAC01D14DBC1D7481BF; // 0x3110(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_609D5D464974BF1D780505960A736D0E; // 0x3130(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5BD8C94C435CA6296D30AF8769DE25F3; // 0x31E0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_0371F6F047B15857A8199A8C2E0C2495; // 0x3200(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_CC67F2FA413DCF2432CC44A60F7EFBDD; // 0x3220(0x0020)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_507DBF9F4453B515D2F360A4994E9A0D;  // 0x3240(0x01E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87B625524B7BF514941D4180AD7CF45C; // 0x3420(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6259645A449B5F6C741EB0B1E2790C0A; // 0x3448(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0627BCE84062A2D421A03B80F1F7E793; // 0x3470(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41A99E1A436DD88AB39F618615CDF6E1; // 0x3498(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01D672B14CAE5CE3C92FE59E0E2443BA; // 0x34C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9E7E274C44C7B0CE653DBB8C88CB3028; // 0x34E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4278F764490B72A7AA36F8A47737D3CD; // 0x3510(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_85E5AF1343F378A0F0E5DDB30AEA8A94; // 0x3538(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_57FD9BC646E02D015241A99E0EB5B820; // 0x3560(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8BDD864C4A8D17A285ABE7A498D94A5B; // 0x3588(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1B63094440AE16083C5594B18801ED8F; // 0x35B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_820F4D1D4D6CC60E5219D9868976493A; // 0x35D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E62349584B35927EC9FF6D9F3474DD36; // 0x3600(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C42C12744F03FF5BDC92A7BDF8D487C4; // 0x3628(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F9625EDA4BDC41303C4A5CA8156729E1; // 0x3650(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_99B3C18243D84A06736A5B956065E7E2; // 0x3678(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_920294D4450E8079DA07F6B75BB11C4A; // 0x36A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F3B6D8174918025E89233D989014B53E; // 0x36C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6501350C44CCA5B47B8CC48B9C218161; // 0x36F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01EBDA0444E1CE54DA32FEA821594A01; // 0x3718(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A8E035346E22EFDB5A412817C6C4B93; // 0x3740(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9E6A1634E38D50D0C2DF88BF722AC29; // 0x3768(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C068BB214CCAA274F520D88F03378F1D; // 0x3790(0x0078)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7A0DEC2040F074CD69A9DE85A3877658; // 0x3808(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_9878ACB34E17C1AEC36D6387A7D4D0D3; // 0x3828(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F8A28D80465593BB0AF90791543BED22; // 0x3848(0x0108)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_47BD942F4CADB83D9A529F86070E2CF8; // 0x3950(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BC6D6B9A4A25171192F59DBB071BE4FA; // 0x3A08(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_99C8D9D14ED52E79B60977A6C95DA9AB; // 0x3A80(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6EBDD2CF495A52B15F51069164518063; // 0x3AA0(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_02D64203438A2AF206DA91BB0B77C491; // 0x3B18(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_212154F741C7959889A0D9B517DA66A5; // 0x3BD0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8B1D27CE439C7205A275979C1423C9DC; // 0x3C48(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_01AF4EF343000924790E278031750E32; // 0x3C68(0x0078)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_66D594354FDC93C0764AF18CE3B9B158; // 0x3CE0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_444750C94C93FB1BF6D9F6918A1611A5; // 0x3D00(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B8202BD348D0C6A6AE671385CA19D38D; // 0x3D20(0x0108)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3979DED740F13C8484CD30944808C828; // 0x3E28(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_51B327D847449ED4E49BC488DED27B7E; // 0x3EE0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B126EA9A4C80F854081E88A32B870F28; // 0x3F58(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_037FED8F43673A6712C876879D7CF100; // 0x3F78(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2F78CDB342F86B1104FA84992F723586; // 0x3FF0(0x00B8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7B9AF611489DDF9ED6B598ABF03F2FDF; // 0x40A8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2C81B6A640DDC274571712982D1F78C6; // 0x4188(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_92D6BFFF48EB9D22A2185383C71D4C37; // 0x41A8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_932617704ED09EEE80BEC7B4F5E58EBF; // 0x4220(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_692DE2F2463E9253F3543D8181A86107; // 0x4240(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_09859F394DF4EFFEC377CCA708AA769A; // 0x42B8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B47600364A1DFA53F2B2ECA1C37EE42B; // 0x42D8(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_302514E24ACD4845CEEB88B46722093E; // 0x4350(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_373995E140A0DA0C7614C3B2592EAD6F; // 0x4408(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0D43EFD94A97C7FAF3F6B9A536557D16; // 0x4480(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D3E2DCCC4277972B36108A9F9AB5B850; // 0x44A0(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8FCD72C14C0FBAD4D8DD669F523FC627; // 0x4518(0x00B8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_13945F96439A09B71CAA74BED73107D0; // 0x45D0(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4353511D4E159B8160EB9D896EF83AE4; // 0x46B0(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C4EBA01D4ED630F247B4908B80F28B9A; // 0x46D0(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D6A793DB481C5A18259067A1A94348D4; // 0x4780(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3AD848B54241670890C325B4481597E4; // 0x47A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9AA2E46C45A6BE97593C689387AC1882; // 0x47C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83CF9C4847924230C775B780B68613D1; // 0x47F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_471304ED4E489BA629B54CB644F6FBBC; // 0x4818(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D5C252C45A0C7921DA406B43E95692E; // 0x4840(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_51582865412CD58472AB44BE89C2D692; // 0x4868(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B1DF87904AE51381E8B893B575AF0226; // 0x4890(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CDBB098444A005C2A0B99BB97F2E60CF; // 0x48B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB731A834C82B39CCD97279335ED5D39; // 0x48E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_124B462748E7AC7005147A837110E8FE; // 0x4908(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8C15EBC24964561C5BE9D1BAF6B89454; // 0x4930(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6D7A1CFB42C81A3DB4A9FAB4B6732417; // 0x4958(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5F153A4A4DCE1B14AC81D4B5F2C701F7; // 0x4980(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA7D8F934F0194B9B7C22F9D6813C2FB; // 0x49A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A30A74E444D86FA73E48018086B5081F; // 0x49D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B2F0540D42D56B9E1E30CE821AB20CB4; // 0x49F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D21C9F274AD0E51B65FC27B654124DBB; // 0x4A20(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EEFE5DB649F85367659B7CB4B47120A2; // 0x4A48(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3FD4C394464DC03F8249E9B0E6EB8F27; // 0x4A70(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FB2CD4BC4D988609A3E6FDAED7813044; // 0x4A98(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42BC64794CC50B7AC83B39B06D9E3ABA; // 0x4AC0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC9BDA7949F05F279CB99AAC0D9CC446; // 0x4AE8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D1E985354F142F472AD2CE8215DF7242; // 0x4B10(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0BD06B64D120C6EF766178A31F7BC0E; // 0x4B38(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C59D4404F29F5D3BC287CAED9B4B203; // 0x4B60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3F8CBB304C67F0787313CC8F85B52F96; // 0x4B88(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F3F7F5A84A7C39158A710E8E0D2DEA2B; // 0x4BB0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_66614D7A46B8A39744EBCE8488502553; // 0x4BD8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9AFB8AA403BE38B8B5657A69BA06133; // 0x4C00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC06981F46FBAAFC62AE1A99B6419EF0; // 0x4C28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A6D7F30D4C69E04DC96B1D8E3CDE17F1; // 0x4C50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54D688C24F6B6DD1B1D301B074D960E3; // 0x4C78(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DD9100A34AD6A985B2A6409FEE728F5F; // 0x4CA0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5E9453E04FD63481B612E7987FDBC5FB; // 0x4CC8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F9CFCE484996F454167408A95C0E6407; // 0x4CF0(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_9D785CA0415E91318169FAAD59D5A16D; // 0x4D68(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_131BAC6743EA66B4532676B55408BCA9; // 0x4E20(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B334D86148AA5474BB3552B5BC2065FD; // 0x4E98(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EE1059B841FEF1204418D489542489D1; // 0x4EB8(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_DBA1A0CB40FEBB938722B6A8D27B971A; // 0x4F30(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_342CD3124ABFE80BA46E4C9A45314D87; // 0x4FE8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_067A6A9D4109C544A9B347A4085BD691; // 0x5060(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_74DA097E4DC383D9D8732782DE74A2AF; // 0x5080(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_326C4AAB498C1316E231D195DC989DC7; // 0x50F8(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3FE6F1AA4977152F514714A521232DC2; // 0x51B0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D30CEA44419416FC77575BBF506FB1E6; // 0x5228(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_85015C814BB5E8D595DF1A86755F8866; // 0x5248(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_A285A7E3445BA312D55471B40A5E9BB3; // 0x52C0(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B6867172437EA94F17AD9DA8165DBEEF; // 0x5378(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C69B679542AF5136E36927B13D69DAA9; // 0x53F0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7E4BFBC743351658F240E984957F3E78; // 0x5410(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D100A4C14F72AF2EE1CB27AD34E6146C; // 0x5488(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BFB2EB6B499EAF70168783B2503CC90C; // 0x5540(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_181381724CAFBF4FB2080AA2F5BA678A; // 0x55B8(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C2042ABB4EAB659AECB7388821EA504B; // 0x55D8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD85F67D4DAA8A46CCD4AC86B806CB44; // 0x56B8(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_95DD001B485B5942A15FDDA39CB0F0C2; // 0x5730(0x00B8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4537E64948DE3399D3F7E1AFE6C87E02; // 0x57E8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_427EE8A44788B08137F40D9E5E489C20; // 0x5808(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_0F3D59664A5C3E82E784D8B61B1F06F8; // 0x5880(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_349D0C60467CFD3978926780838C70A8; // 0x5938(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9B92E3624B2656B4939290A5E991D486; // 0x59B0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2149BCFB4346E344FD4B25A6CC5A8D20; // 0x59D0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_6A1616A04C44A40DDAA3DCACBD60E60A; // 0x59F0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0A6C01F2426172B3779FF0B978CF41AA; // 0x5A10(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FF3822F84B38824616C59497CB6D4E91; // 0x5B18(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E3F81E7E4237987A62949BA0E36F6404; // 0x5B90(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3A02560B4FAA9B15780EA9A8F3848785; // 0x5BB0(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_308548F349FD0F66AFCB75B32A8852A3; // 0x5C28(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_68AF23DA489F4468D7EA4CA55B188B4E; // 0x5CE0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1485E1E145BF13BBFB7996890519F240; // 0x5D58(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E77CA6F3475F696FB7348E9602CDBFFA; // 0x5D78(0x00E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5318E54F4CB7804BEFB4CB95FB5D2C6E; // 0x5E58(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_93795E81483F40EAF03243A4EBBA54CD; // 0x5F60(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_51B918C14FF54144804144B732B0E460; // 0x5FD8(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_CA259332491975B1AAFA1A95CD95EDE5; // 0x6090(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_E11D37B74874A0EE9D0FFBB5390CA778; // 0x60B0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_92FD2D8940F57671571F88A19E5A228C; // 0x60D0(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A9AAE3E44B784E9402C991BF3A546089; // 0x61D8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_378A7C2B4A0594CD1F6B818A5018D031; // 0x61F8(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6415BF0C4C1F56D137BDE79881EBEDDB; // 0x62A8(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5EA8AFC42A91A0BAD0E7E8F5888609B; // 0x62C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5BAEE1E46C83976774ECC894D56E65C; // 0x62F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1687DFEF451474F4976441A6BF0AAE13; // 0x6318(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_70A46F5741D8950789CE95A5B5BA56DA; // 0x6340(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B5D96794351ABF1CA3A0685F2AC8705; // 0x6368(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1385912F4C335974D045E7B9DD94638F; // 0x6390(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_951588D3410AC496A0069A8B49929570; // 0x63B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F7569BAA4263ECE4432B47A529EAE549; // 0x63E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA511FEB4CA31660038EE4A072490CBB; // 0x6408(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_90EFA3C14A2994A6908BC19090F613F7; // 0x6430(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88FFD08F46918B9100F0D9AAE621BF26; // 0x6458(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E24763C740DFF23AD3676A99E4E65C86; // 0x6480(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8E5378D54C4F315FB59CB5832F4BB5A5; // 0x64A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0CDC7C9484A1BAE1C05E3B8DC9A62DB; // 0x64D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8F6AF590434A87ABCE9373BC67AC7167; // 0x64F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0E5600E749E02A0745BDCFB8C52D0520; // 0x6520(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_078BE63F4C1D38FDAD64328E2D26E5F3; // 0x6548(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6AAB208B435AAFBA64054A98D1729742; // 0x6570(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C4294554A7CF59619F7D2A690336953; // 0x6598(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8C652D249DC787B8466BCA1C9799F6D; // 0x65C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CBF6E3AA45F7995E8EED0495A61EC488; // 0x65E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_283F57C64F02338503B38FB1B3E05B33; // 0x6610(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_646733F24F4176215F0C418DA0ED150F; // 0x6638(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_FEA242414B487D863AFC9D89C3FA115C; // 0x6658(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_09CF4E2B4F39C88DEDE3DB99558E63A0; // 0x6678(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6E7D25DE47DA8B6526E9E581349FA770; // 0x6780(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_AF30A5C8411F32C9D20060B1D293374F; // 0x67F8(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8456EA0F42080C2FE133FC8375CD7692; // 0x68B0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2C3D9836430ADCF4AF1E088D9A822EA4; // 0x6928(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_41E9E17E4FC681F94634229E148B11C2; // 0x6948(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_14D0C2364DA1E1E9003E3DB2CE539FA1; // 0x6968(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_35CDA9A846CE04340870EE8B7A4B3E90; // 0x6988(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A3CAAA3943B50F3E2F795284FE356894; // 0x6A90(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_23069C3B45136A36749EE4A0FBE1DFA7; // 0x6B08(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_05114D7C4342CDAAAACAB58570A3F8A8; // 0x6BC0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C068B6CD4828FD26D8FC70A9F02777EF; // 0x6C38(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8CDEA6BF49114428C98DDDB559634E28; // 0x6C58(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_417844C44AC34E879B4F2AB7DC1D7E35; // 0x6C78(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_62F8DBE9410C1E5BD508619BFF366A7D; // 0x6C98(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2E22000146E57B81C1095E8AFEB9D422; // 0x6DA0(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4EDC5126468D423F7C7BC4A4D2B6D605; // 0x6E18(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD1607134D19CA68FB726CB59AA7B502; // 0x6ED0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_935381A9470F7CED839D6C89AC686CF5; // 0x6F48(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7D159AC74A3F9B38BF277CA0DD0A7605; // 0x6F68(0x00E0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_E8B44E27414A1A8F5F7429B195CB16FC; // 0x7048(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_AF83A65D40816A21FD28BDAF67733563; // 0x7068(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_27848D9D4EF0E3046C98C787DDC38705; // 0x7088(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F29AE49C41E658914633A78EB6C215FB; // 0x7190(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_F416432F4B2ECB2A2D15DFBB4AEFFB08; // 0x7208(0x00B8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2E5C41B24DBA74CF7E83FE88FAFD04A3; // 0x72C0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D6ABBD9E43A4AAB86E547E833391C69E; // 0x72E0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_40E70EB745FF6C9A230BB2A6363DEA4F; // 0x7300(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5727F6AB427AA782EEB9CB8A27A4AC68; // 0x7320(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E453E73F4A169AF006EC2096E0C84950; // 0x7428(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_FFFF05F64D326D53DD95809CB9FE9AC4; // 0x74A0(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17751E834144B81E30DAA49C734FA02D; // 0x7558(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_114F91F14C01BD606FFC5EB03BFB33DB; // 0x75D0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_61B4742F425752B5692D9B809C3D2E3F; // 0x75F0(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_64B23DC8414D17FB7466889DB9F40144; // 0x76F8(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_49167A434B2347C49EC08B955A7106AC; // 0x7718(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3F8F115B43859E2A7226CB9C73DD02B8; // 0x7738(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_86E1CC4F48F4D1412EE56EBD5EA82D96; // 0x7840(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BE15A7E84274DA22FC3EA8A2FDF8074F; // 0x78B8(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E87C29C74F588AF85370DC80419A01B5; // 0x7930(0x00B8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2B3AA9D24BD31CCF0A10B385BBABEB81; // 0x79E8(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F25C7DDE4CC1DB5025A68386493EF1F9; // 0x7A08(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_D5EBECA1432FA65DACA27AAD5D926FB5; // 0x7A28(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DA9CAFC548F84A99625D60A7DC9FD089; // 0x7A48(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AC5DEED14F404044CBE617950AE63AA5; // 0x7B50(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_FDE803464C43748F62F9809076C24D7F; // 0x7BC8(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_21E5D79A4430EE7ADC990EB68BD31F63; // 0x7C80(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_450AAA8A4E96DADD37F763A66598BA6B; // 0x7CF8(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_709EE6EE4251C338D493ABB2146CFB95; // 0x7D18(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_50B43FB34434298F76E3EC9E13E71BDF; // 0x7DF8(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_F8F0D8F24C4E43A3496C43B4FCA18BEB; // 0x7E70(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_9D0DD0E84BC6702F569932AF5BB21275; // 0x7F28(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_DB1B5D9B49246DC9CD2A0AAD9E1D5BED; // 0x7F48(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2D743BB7461482380464AD8B477B4DA6; // 0x7F68(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_44AA08FA490EF3D34BD6C8B6A69721A2; // 0x8070(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D0E68B594C55DB08B46D039F7A3B7D3A; // 0x8090(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8702E5764F6EED252A6B6A9E398C448C; // 0x8140(0x0020)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_1C852A004464E16292C3FF8C46A37508;       // 0x8160(0x0048)
	unsigned char                                      UnknownData_BNZD[0x8];                                     // 0x81A8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_46AAFDDC47768F0DB48F21B771FA9100;     // 0x81B0(0x0190)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_FD3C3DD14E5F867E86C7409B18D4CCDB; // 0x8340(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_E807B1844E98BA227BD4119B56BD570C; // 0x8360(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF59393A400BE9F3E1552CAFE0BD3BCA; // 0x8380(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88308FDC4A579827B200308DCCBD2972; // 0x83A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FB868D164BE87C90E1F631AD2AD8859C; // 0x83D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9507DB8D4282ED6D60577D9BB9E35A60; // 0x83F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8FDC4C5A46950091D4322DB3C52D3706; // 0x8420(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DCE9A1294FA2B551E8B0A3A0E1324E12; // 0x8448(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F112407428F6B68CCD89BB6DFB30739; // 0x8470(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FA4700A14D6C50FB026409BFAD658628; // 0x8498(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE3CF52B40E87015717E45A57173195A; // 0x84C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EAF706E54FC17FB1C2CFD5BBBBAA0DC0; // 0x84E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB70B4EA4A488792B9D7ABB025D8E6BA; // 0x8510(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_759B66B84F1CAB1CB0C43B83E2241E8F; // 0x8538(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CBFF38C044181F0053DE408418A6F24B; // 0x8560(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_35738F6B48D4FDE07B6EFB9B4C731A61; // 0x8588(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01C0EFDA435A22CD41F934926C67D8C4; // 0x85B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D3908E89408E1D7DD2C5CA80E709696F; // 0x85D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_96CF4B9E4CF6534FF1FF5495D01ADA30; // 0x8600(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_327E5BAA4486DDC0356237AFA566C209; // 0x8628(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02A3EC6B40EDB7F187817EA7C7DBF884; // 0x8650(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_739BD2C54E5827776B1992B4319D2A31; // 0x8678(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BBCC9BAB4AAD72C099630B8E5CD0F679; // 0x86A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B55C7B54DEDA687F4921282543FFF9B; // 0x86C8(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_11F1F4CF463C30D0BC6A79B78058E848; // 0x86F0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2172CD174E2C476E3B589CB49ADF0221; // 0x8710(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DDB7A9744CB1A26E5CBDEF913324F6EE; // 0x8730(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1036CEB94D5991A60185F7AE734E7B57; // 0x8838(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E445C0494D136486096844A950CD1B81; // 0x88B0(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EF45377D4B520C66F1ACA2B6EC0B5CB7; // 0x8968(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_221D2AE143020CF2922B678AE614F8D9; // 0x89E0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9367CD0A476E0CC7FBC66F836D020BDE; // 0x8A00(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_93A6737D4766E6B938F69CB1A60E626A; // 0x8A78(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_102C140540EDD4BEDA0FAB90B49A969A; // 0x8B30(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7E973F974F7AE9A4FB4ABE911B720CA5; // 0x8BA8(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7DA23A354915F57FCC0BEB84ABED4F7E; // 0x8BC8(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_70F7609A4D3E29A6211B9D9893F2B77B; // 0x8BE8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E71BFBB144F6F188F85D28B28C74389F; // 0x8C08(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_885EBD3B4C4BADBC73125E95551A8FC1; // 0x8D10(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3DE14A6F4239DEE494D198AC75CA6467; // 0x8D88(0x00B8)
