#pragma once

// Name: pns, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function UWorksCore.UWorksInterfaceCoreAppList.GetNumInstalledApps
struct UUWorksInterfaceCoreAppList_GetNumInstalledApps_Params
{
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreAppList.GetInstalledApps
struct UUWorksInterfaceCoreAppList_GetInstalledApps_Params
{
	TArray<int>                                        AppIDs;                                                    // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                MaxAppIDs;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreAppList.GetAppName
struct UUWorksInterfaceCoreAppList_GetAppName_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Name;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NameMaxLength;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreAppList.GetAppList
struct UUWorksInterfaceCoreAppList_GetAppList_Params
{
	class UUWorksInterfaceCoreAppList*                 ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreAppList.GetAppInstallDir
struct UUWorksInterfaceCoreAppList_GetAppInstallDir_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Directory;                                                 // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                DirectoryMaxLength;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreAppList.GetAppBuildId
struct UUWorksInterfaceCoreAppList_GetAppBuildId_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.UninstallDLC
struct UUWorksInterfaceCoreApps_UninstallDLC_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.MarkContentCorrupt
struct UUWorksInterfaceCoreApps_MarkContentCorrupt_Params
{
	bool                                               bMissingFilesOnly;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.InstallDLC
struct UUWorksInterfaceCoreApps_InstallDLC_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetLaunchQueryParam
struct UUWorksInterfaceCoreApps_GetLaunchQueryParam_Params
{
	struct FString                                     Key;                                                       // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetInstalledDepots
struct UUWorksInterfaceCoreApps_GetInstalledDepots_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int>                                        Depots;                                                    // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                MaxDepots;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetFileDetailsMinimal
struct UUWorksInterfaceCoreApps_GetFileDetailsMinimal_Params
{
	struct FScriptDelegate                             Completed;                                                 // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FString                                     Filename;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetFileDetails
struct UUWorksInterfaceCoreApps_GetFileDetails_Params
{
	class UUWorksRequestCoreGetFileDetails*            ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetEarliestPurchaseUnixTime
struct UUWorksInterfaceCoreApps_GetEarliestPurchaseUnixTime_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetDlcDownloadProgress
struct UUWorksInterfaceCoreApps_GetDlcDownloadProgress_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                BytesDownloaded;                                           // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                BytesTotal;                                                // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetDLCCount
struct UUWorksInterfaceCoreApps_GetDLCCount_Params
{
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetCurrentGameLanguage
struct UUWorksInterfaceCoreApps_GetCurrentGameLanguage_Params
{
	struct FString                                     ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetCurrentBetaName
struct UUWorksInterfaceCoreApps_GetCurrentBetaName_Params
{
	struct FString                                     Name;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NameMaxLength;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetAvailableGameLanguages
struct UUWorksInterfaceCoreApps_GetAvailableGameLanguages_Params
{
	struct FString                                     ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetApps
struct UUWorksInterfaceCoreApps_GetApps_Params
{
	class UUWorksInterfaceCoreApps*                    ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetAppOwner
struct UUWorksInterfaceCoreApps_GetAppOwner_Params
{
	struct FUWorksSteamID                              ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetAppInstallDir
struct UUWorksInterfaceCoreApps_GetAppInstallDir_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Path;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PathMaxLength;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.GetAppBuildId
struct UUWorksInterfaceCoreApps_GetAppBuildId_Params
{
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.BIsVACBanned
struct UUWorksInterfaceCoreApps_BIsVACBanned_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.BIsSubscribedFromFreeWeekend
struct UUWorksInterfaceCoreApps_BIsSubscribedFromFreeWeekend_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.BIsSubscribedApp
struct UUWorksInterfaceCoreApps_BIsSubscribedApp_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.BIsSubscribed
struct UUWorksInterfaceCoreApps_BIsSubscribed_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.BIsLowViolence
struct UUWorksInterfaceCoreApps_BIsLowViolence_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.BIsDlcInstalled
struct UUWorksInterfaceCoreApps_BIsDlcInstalled_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.BIsCybercafe
struct UUWorksInterfaceCoreApps_BIsCybercafe_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.BIsAppInstalled
struct UUWorksInterfaceCoreApps_BIsAppInstalled_Params
{
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreApps.BGetDLCDataByIndex
struct UUWorksInterfaceCoreApps_BGetDLCDataByIndex_Params
{
	int                                                DLC;                                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                AppID;                                                     // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAvailable;                                                // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Name;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NameMaxLength;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.TriggerVibration
struct UUWorksInterfaceCoreController_TriggerVibration_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	int                                                LeftSpeed;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                RightSpeed;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.TriggerRepeatedHapticPulse
struct UUWorksInterfaceCoreController_TriggerRepeatedHapticPulse_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	UWorksCore_EUWorksSteamControllerPad               TargetPad;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                DurationMicroSec;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                OffMicroSec;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Repeat;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Flags;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.TriggerHapticPulse
struct UUWorksInterfaceCoreController_TriggerHapticPulse_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	UWorksCore_EUWorksSteamControllerPad               TargetPad;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                DurationMicroSec;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.StopAnalogActionMomentum
struct UUWorksInterfaceCoreController_StopAnalogActionMomentum_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerAnalogActionHandle         action;                                                    // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.Shutdown
struct UUWorksInterfaceCoreController_Shutdown_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.ShowBindingPanel
struct UUWorksInterfaceCoreController_ShowBindingPanel_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.SetLEDColor
struct UUWorksInterfaceCoreController_SetLEDColor_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      ColorR;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      ColorG;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      ColorB;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<UWorksCore_EUWorksSteamControllerLEDFlag>   Flags;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.RunFrame
struct UUWorksInterfaceCoreController_RunFrame_Params
{
};

// Function UWorksCore.UWorksInterfaceCoreController.Init
struct UUWorksInterfaceCoreController_Init_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetStringForActionOrigin
struct UUWorksInterfaceCoreController_GetStringForActionOrigin_Params
{
	UWorksCore_EUWorksControllerActionOrigin           Origin;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetMotionData
struct UUWorksInterfaceCoreController_GetMotionData_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerMotionData                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetGlyphForActionOrigin
struct UUWorksInterfaceCoreController_GetGlyphForActionOrigin_Params
{
	UWorksCore_EUWorksControllerActionOrigin           Origin;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetGamepadIndexForController
struct UUWorksInterfaceCoreController_GetGamepadIndexForController_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetDigitalActionOrigins
struct UUWorksInterfaceCoreController_GetDigitalActionOrigins_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerActionSetHandle            ActionSetHandle;                                           // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerDigitalActionHandle        DigitalActionHandle;                                       // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<UWorksCore_EUWorksControllerActionOrigin>   OriginsOut;                                                // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetDigitalActionHandle
struct UUWorksInterfaceCoreController_GetDigitalActionHandle_Params
{
	struct FString                                     ActionName;                                                // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWorksControllerDigitalActionHandle        ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetDigitalActionData
struct UUWorksInterfaceCoreController_GetDigitalActionData_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerDigitalActionHandle        DigitalActionHandle;                                       // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerDigitalActionData          ReturnValue;                                               // 0x0000(0x0002)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetCurrentActionSet
struct UUWorksInterfaceCoreController_GetCurrentActionSet_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerActionSetHandle            ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetControllerForGamepadIndex
struct UUWorksInterfaceCoreController_GetControllerForGamepadIndex_Params
{
	int                                                Index;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWorksControllerHandle                     ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetController
struct UUWorksInterfaceCoreController_GetController_Params
{
	class UUWorksInterfaceCoreController*              ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetConnectedControllers
struct UUWorksInterfaceCoreController_GetConnectedControllers_Params
{
	TArray<struct FUWorksControllerHandle>             HandlesOut;                                                // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetAnalogActionOrigins
struct UUWorksInterfaceCoreController_GetAnalogActionOrigins_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerActionSetHandle            ActionSetHandle;                                           // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerAnalogActionHandle         AnalogActionHandle;                                        // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<UWorksCore_EUWorksControllerActionOrigin>   OriginsOut;                                                // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetAnalogActionHandle
struct UUWorksInterfaceCoreController_GetAnalogActionHandle_Params
{
	struct FString                                     ActionName;                                                // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWorksControllerAnalogActionHandle         ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetAnalogActionData
struct UUWorksInterfaceCoreController_GetAnalogActionData_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerAnalogActionHandle         AnalogActionHandle;                                        // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerAnalogActionData           ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.GetActionSetHandle
struct UUWorksInterfaceCoreController_GetActionSetHandle_Params
{
	struct FString                                     ActionSetName;                                             // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWorksControllerActionSetHandle            ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreController.ActivateActionSet
struct UUWorksInterfaceCoreController_ActivateActionSet_Params
{
	struct FUWorksControllerHandle                     ControllerHandle;                                          // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksControllerActionSetHandle            ActionSetHandle;                                           // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.SetRichPresence
struct UUWorksInterfaceCoreFriends_SetRichPresence_Params
{
	struct FString                                     Key;                                                       // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Value;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.SetPlayedWith
struct UUWorksInterfaceCoreFriends_SetPlayedWith_Params
{
	struct FUWorksSteamID                              SteamIDUserPlayedWith;                                     // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.SetPersonaNameMinimal
struct UUWorksInterfaceCoreFriends_SetPersonaNameMinimal_Params
{
	struct FScriptDelegate                             Completed;                                                 // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FString                                     Name;                                                      // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.SetPersonaName
struct UUWorksInterfaceCoreFriends_SetPersonaName_Params
{
	class UUWorksRequestCoreSetPersonaName*            ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.SetListenForFriendsMessages
struct UUWorksInterfaceCoreFriends_SetListenForFriendsMessages_Params
{
	bool                                               bInterceptEnabled;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.SetInGameVoiceSpeaking
struct UUWorksInterfaceCoreFriends_SetInGameVoiceSpeaking_Params
{
	struct FUWorksSteamID                              SteamIDUser;                                               // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bSpeaking;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.SendClanChatMessage
struct UUWorksInterfaceCoreFriends_SendClanChatMessage_Params
{
	struct FUWorksSteamID                              SteamIDClanChat;                                           // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FString                                     Text;                                                      // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.RequestUserInformation
struct UUWorksInterfaceCoreFriends_RequestUserInformation_Params
{
	struct FUWorksSteamID                              SteamIDUser;                                               // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bRequireNameOnly;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.RequestFriendRichPresence
struct UUWorksInterfaceCoreFriends_RequestFriendRichPresence_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.RequestClanOfficerListMinimal
struct UUWorksInterfaceCoreFriends_RequestClanOfficerListMinimal_Params
{
	struct FScriptDelegate                             Completed;                                                 // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksSteamID                              SteamID;                                                   // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.RequestClanOfficerList
struct UUWorksInterfaceCoreFriends_RequestClanOfficerList_Params
{
	class UUWorksRequestCoreRequestClanOfficerList*    ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.ReplyToFriendMessage
struct UUWorksInterfaceCoreFriends_ReplyToFriendMessage_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FString                                     MessageToSend;                                             // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.OpenClanChatWindowInSteam
struct UUWorksInterfaceCoreFriends_OpenClanChatWindowInSteam_Params
{
	struct FUWorksSteamID                              SteamIDClanChat;                                           // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.LeaveClanChatRoom
struct UUWorksInterfaceCoreFriends_LeaveClanChatRoom_Params
{
	struct FUWorksSteamID                              SteamIDClan;                                               // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.JoinClanChatRoomMinimal
struct UUWorksInterfaceCoreFriends_JoinClanChatRoomMinimal_Params
{
	struct FScriptDelegate                             Completed;                                                 // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksSteamID                              SteamIDClan;                                               // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.JoinClanChatRoom
struct UUWorksInterfaceCoreFriends_JoinClanChatRoom_Params
{
	class UUWorksRequestCoreJoinClanChatRoom*          ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.IsUserInSource
struct UUWorksInterfaceCoreFriends_IsUserInSource_Params
{
	struct FUWorksSteamID                              SteamIDUser;                                               // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksSteamID                              SteamIDSource;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.IsFollowingMinimal
struct UUWorksInterfaceCoreFriends_IsFollowingMinimal_Params
{
	struct FScriptDelegate                             Completed;                                                 // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksSteamID                              SteamID;                                                   // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.IsFollowing
struct UUWorksInterfaceCoreFriends_IsFollowing_Params
{
	class UUWorksRequestCoreIsFollowing*               ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.IsClanChatWindowOpenInSteam
struct UUWorksInterfaceCoreFriends_IsClanChatWindowOpenInSteam_Params
{
	struct FUWorksSteamID                              SteamIDClanChat;                                           // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.IsClanChatAdmin
struct UUWorksInterfaceCoreFriends_IsClanChatAdmin_Params
{
	struct FUWorksSteamID                              SteamIDClanChat;                                           // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWorksSteamID                              SteamIDUser;                                               // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.InviteUserToGame
struct UUWorksInterfaceCoreFriends_InviteUserToGame_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FString                                     ConnectString;                                             // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.HasFriend
struct UUWorksInterfaceCoreFriends_HasFriend_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<UWorksCore_EUWorksFriendFlags>              FriendFlags;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetUserRestrictions
struct UUWorksInterfaceCoreFriends_GetUserRestrictions_Params
{
	TArray<UWorksCore_EUWorksUserRestriction>          ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetSmallFriendAvatar
struct UUWorksInterfaceCoreFriends_GetSmallFriendAvatar_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UTexture2D*                                  ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetPlayerNickname
struct UUWorksInterfaceCoreFriends_GetPlayerNickname_Params
{
	struct FUWorksSteamID                              SteamIDPlayer;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FString                                     ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetPersonaState
struct UUWorksInterfaceCoreFriends_GetPersonaState_Params
{
	UWorksCore_EUWorksPersonaState                     ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetPersonaName
struct UUWorksInterfaceCoreFriends_GetPersonaName_Params
{
	struct FString                                     ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetMediumFriendAvatar
struct UUWorksInterfaceCoreFriends_GetMediumFriendAvatar_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UTexture2D*                                  ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetLargeFriendAvatar
struct UUWorksInterfaceCoreFriends_GetLargeFriendAvatar_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UTexture2D*                                  ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriendSteamLevel
struct UUWorksInterfaceCoreFriends_GetFriendSteamLevel_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriendsGroupName
struct UUWorksInterfaceCoreFriends_GetFriendsGroupName_Params
{
	struct FUWorksFriendsGroupID                       FriendsGroupID;                                            // 0x0000(0x0002)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FString                                     ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriendsGroupMembersList
struct UUWorksInterfaceCoreFriends_GetFriendsGroupMembersList_Params
{
	struct FUWorksFriendsGroupID                       FriendsGroupID;                                            // 0x0000(0x0002)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FUWorksSteamID>                      SteamIDMembers;                                            // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                MembersCount;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriendsGroupMembersCount
struct UUWorksInterfaceCoreFriends_GetFriendsGroupMembersCount_Params
{
	struct FUWorksFriendsGroupID                       FriendsGroupID;                                            // 0x0000(0x0002)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriendsGroupIDByIndex
struct UUWorksInterfaceCoreFriends_GetFriendsGroupIDByIndex_Params
{
	int                                                FriendGroup;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWorksFriendsGroupID                       ReturnValue;                                               // 0x0000(0x0002)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriendsGroupCount
struct UUWorksInterfaceCoreFriends_GetFriendsGroupCount_Params
{
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriends
struct UUWorksInterfaceCoreFriends_GetFriends_Params
{
	class UUWorksInterfaceCoreFriends*                 ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriendRichPresenceKeyCount
struct UUWorksInterfaceCoreFriends_GetFriendRichPresenceKeyCount_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriendRichPresenceKeyByIndex
struct UUWorksInterfaceCoreFriends_GetFriendRichPresenceKeyByIndex_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	int                                                Key;                                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriendRichPresence
struct UUWorksInterfaceCoreFriends_GetFriendRichPresence_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FString                                     Key;                                                       // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriendRelationship
struct UUWorksInterfaceCoreFriends_GetFriendRelationship_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	UWorksCore_EUWorksFriendRelationship               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWorksCore.UWorksInterfaceCoreFriends.GetFriendPersonaState
struct UUWorksInterfaceCoreFriends_GetFriendPersonaState_Params
{
	struct FUWorksSteamID                              SteamIDFriend;                                             // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
